SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 SMCTRL register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_SMCTRL_H
#define EFR32FG25_SMCTRL_H
#define SMCTRL_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_SMCTRL SMCTRL
 * @{
 * @brief EFR32FG25 SMCTRL Register Declaration.
 *****************************************************************************/

/** SMCTRL Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< Module Enable                                      */
  __IOM uint32_t SWRST;                         /**< Software Reset                                     */
  uint32_t       RESERVED0[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t MAINIF;                        /**< Main CPU Interrupt Flag                            */
  __IOM uint32_t MAINIEN;                       /**< Main CPU Interrupt Enable                          */
  __IOM uint32_t SEQIF;                         /**< Sequencer's Interrupt Flag                         */
  __IOM uint32_t SEQIEN;                        /**< Seuencer's Interrupt Enable                        */
  __IOM uint32_t SWIF;                          /**< Local SW Interrupt Flag                            */
  __IOM uint32_t SWIEN;                         /**< Local SW Interrupt Enable                          */
  __IOM uint32_t GPREG;                         /**< New Register                                       */
  __IOM uint32_t TIMIF;                         /**< Timer's Interrupt Flag                             */
  __IOM uint32_t TIMIEN;                        /**< Timer's Interrupt Enable                           */
  uint32_t       RESERVED1[51U];                /**< Reserved for future use                            */
  __IOM uint32_t FRCRXCTRL;                     /**< New Register                                       */
  __IOM uint32_t CTRL;                          /**< New Register                                       */
  __IM uint32_t  PC;                            /**< New Register                                       */
  uint32_t       RESERVED2[29U];                /**< Reserved for future use                            */
  __IOM uint32_t SCRATCH0;                      /**< SCRATCH0                                           */
  __IOM uint32_t SCRATCH1;                      /**< SCRATCH1                                           */
  __IOM uint32_t SCRATCH2;                      /**< SCRATCH2                                           */
  __IOM uint32_t SCRATCH3;                      /**< SCRATCH3                                           */
  __IOM uint32_t SCRATCH4;                      /**< SCRATCH4                                           */
  __IOM uint32_t SCRATCH5;                      /**< SCRATCH5                                           */
  __IOM uint32_t SCRATCH6;                      /**< SCRATCH6                                           */
  __IOM uint32_t SCRATCH7;                      /**< SCRATCH7                                           */
  uint32_t       RESERVED3[4U];                 /**< Reserved for future use                            */
  __IOM uint32_t PRSMUXLSB;                     /**< New Register                                       */
  __IOM uint32_t PRSMUXMSB;                     /**< New Register                                       */
  __IOM uint32_t PRSOUT;                        /**< New Register                                       */
  uint32_t       RESERVED4[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t RXEVMUX;                       /**< New Register                                       */
  __IOM uint32_t TIMCTRL;                       /**< New Register                                       */
  __IM uint32_t  TIMSTAT;                       /**< New Register                                       */
  uint32_t       RESERVED5[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t SHIFTS;                        /**< New Register                                       */
  __IOM uint32_t TXDONE;                        /**< New Register                                       */
  uint32_t       RESERVED6[906U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_SET;                     /**< Software Reset                                     */
  uint32_t       RESERVED7[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t MAINIF_SET;                    /**< Main CPU Interrupt Flag                            */
  __IOM uint32_t MAINIEN_SET;                   /**< Main CPU Interrupt Enable                          */
  __IOM uint32_t SEQIF_SET;                     /**< Sequencer's Interrupt Flag                         */
  __IOM uint32_t SEQIEN_SET;                    /**< Seuencer's Interrupt Enable                        */
  __IOM uint32_t SWIF_SET;                      /**< Local SW Interrupt Flag                            */
  __IOM uint32_t SWIEN_SET;                     /**< Local SW Interrupt Enable                          */
  __IOM uint32_t GPREG_SET;                     /**< New Register                                       */
  __IOM uint32_t TIMIF_SET;                     /**< Timer's Interrupt Flag                             */
  __IOM uint32_t TIMIEN_SET;                    /**< Timer's Interrupt Enable                           */
  uint32_t       RESERVED8[51U];                /**< Reserved for future use                            */
  __IOM uint32_t FRCRXCTRL_SET;                 /**< New Register                                       */
  __IOM uint32_t CTRL_SET;                      /**< New Register                                       */
  __IM uint32_t  PC_SET;                        /**< New Register                                       */
  uint32_t       RESERVED9[29U];                /**< Reserved for future use                            */
  __IOM uint32_t SCRATCH0_SET;                  /**< SCRATCH0                                           */
  __IOM uint32_t SCRATCH1_SET;                  /**< SCRATCH1                                           */
  __IOM uint32_t SCRATCH2_SET;                  /**< SCRATCH2                                           */
  __IOM uint32_t SCRATCH3_SET;                  /**< SCRATCH3                                           */
  __IOM uint32_t SCRATCH4_SET;                  /**< SCRATCH4                                           */
  __IOM uint32_t SCRATCH5_SET;                  /**< SCRATCH5                                           */
  __IOM uint32_t SCRATCH6_SET;                  /**< SCRATCH6                                           */
  __IOM uint32_t SCRATCH7_SET;                  /**< SCRATCH7                                           */
  uint32_t       RESERVED10[4U];                /**< Reserved for future use                            */
  __IOM uint32_t PRSMUXLSB_SET;                 /**< New Register                                       */
  __IOM uint32_t PRSMUXMSB_SET;                 /**< New Register                                       */
  __IOM uint32_t PRSOUT_SET;                    /**< New Register                                       */
  uint32_t       RESERVED11[1U];                /**< Reserved for future use                            */
  __IOM uint32_t RXEVMUX_SET;                   /**< New Register                                       */
  __IOM uint32_t TIMCTRL_SET;                   /**< New Register                                       */
  __IM uint32_t  TIMSTAT_SET;                   /**< New Register                                       */
  uint32_t       RESERVED12[1U];                /**< Reserved for future use                            */
  __IOM uint32_t SHIFTS_SET;                    /**< New Register                                       */
  __IOM uint32_t TXDONE_SET;                    /**< New Register                                       */
  uint32_t       RESERVED13[906U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_CLR;                     /**< Software Reset                                     */
  uint32_t       RESERVED14[1U];                /**< Reserved for future use                            */
  __IOM uint32_t MAINIF_CLR;                    /**< Main CPU Interrupt Flag                            */
  __IOM uint32_t MAINIEN_CLR;                   /**< Main CPU Interrupt Enable                          */
  __IOM uint32_t SEQIF_CLR;                     /**< Sequencer's Interrupt Flag                         */
  __IOM uint32_t SEQIEN_CLR;                    /**< Seuencer's Interrupt Enable                        */
  __IOM uint32_t SWIF_CLR;                      /**< Local SW Interrupt Flag                            */
  __IOM uint32_t SWIEN_CLR;                     /**< Local SW Interrupt Enable                          */
  __IOM uint32_t GPREG_CLR;                     /**< New Register                                       */
  __IOM uint32_t TIMIF_CLR;                     /**< Timer's Interrupt Flag                             */
  __IOM uint32_t TIMIEN_CLR;                    /**< Timer's Interrupt Enable                           */
  uint32_t       RESERVED15[51U];               /**< Reserved for future use                            */
  __IOM uint32_t FRCRXCTRL_CLR;                 /**< New Register                                       */
  __IOM uint32_t CTRL_CLR;                      /**< New Register                                       */
  __IM uint32_t  PC_CLR;                        /**< New Register                                       */
  uint32_t       RESERVED16[29U];               /**< Reserved for future use                            */
  __IOM uint32_t SCRATCH0_CLR;                  /**< SCRATCH0                                           */
  __IOM uint32_t SCRATCH1_CLR;                  /**< SCRATCH1                                           */
  __IOM uint32_t SCRATCH2_CLR;                  /**< SCRATCH2                                           */
  __IOM uint32_t SCRATCH3_CLR;                  /**< SCRATCH3                                           */
  __IOM uint32_t SCRATCH4_CLR;                  /**< SCRATCH4                                           */
  __IOM uint32_t SCRATCH5_CLR;                  /**< SCRATCH5                                           */
  __IOM uint32_t SCRATCH6_CLR;                  /**< SCRATCH6                                           */
  __IOM uint32_t SCRATCH7_CLR;                  /**< SCRATCH7                                           */
  uint32_t       RESERVED17[4U];                /**< Reserved for future use                            */
  __IOM uint32_t PRSMUXLSB_CLR;                 /**< New Register                                       */
  __IOM uint32_t PRSMUXMSB_CLR;                 /**< New Register                                       */
  __IOM uint32_t PRSOUT_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED18[1U];                /**< Reserved for future use                            */
  __IOM uint32_t RXEVMUX_CLR;                   /**< New Register                                       */
  __IOM uint32_t TIMCTRL_CLR;                   /**< New Register                                       */
  __IM uint32_t  TIMSTAT_CLR;                   /**< New Register                                       */
  uint32_t       RESERVED19[1U];                /**< Reserved for future use                            */
  __IOM uint32_t SHIFTS_CLR;                    /**< New Register                                       */
  __IOM uint32_t TXDONE_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED20[906U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_TGL;                     /**< Software Reset                                     */
  uint32_t       RESERVED21[1U];                /**< Reserved for future use                            */
  __IOM uint32_t MAINIF_TGL;                    /**< Main CPU Interrupt Flag                            */
  __IOM uint32_t MAINIEN_TGL;                   /**< Main CPU Interrupt Enable                          */
  __IOM uint32_t SEQIF_TGL;                     /**< Sequencer's Interrupt Flag                         */
  __IOM uint32_t SEQIEN_TGL;                    /**< Seuencer's Interrupt Enable                        */
  __IOM uint32_t SWIF_TGL;                      /**< Local SW Interrupt Flag                            */
  __IOM uint32_t SWIEN_TGL;                     /**< Local SW Interrupt Enable                          */
  __IOM uint32_t GPREG_TGL;                     /**< New Register                                       */
  __IOM uint32_t TIMIF_TGL;                     /**< Timer's Interrupt Flag                             */
  __IOM uint32_t TIMIEN_TGL;                    /**< Timer's Interrupt Enable                           */
  uint32_t       RESERVED22[51U];               /**< Reserved for future use                            */
  __IOM uint32_t FRCRXCTRL_TGL;                 /**< New Register                                       */
  __IOM uint32_t CTRL_TGL;                      /**< New Register                                       */
  __IM uint32_t  PC_TGL;                        /**< New Register                                       */
  uint32_t       RESERVED23[29U];               /**< Reserved for future use                            */
  __IOM uint32_t SCRATCH0_TGL;                  /**< SCRATCH0                                           */
  __IOM uint32_t SCRATCH1_TGL;                  /**< SCRATCH1                                           */
  __IOM uint32_t SCRATCH2_TGL;                  /**< SCRATCH2                                           */
  __IOM uint32_t SCRATCH3_TGL;                  /**< SCRATCH3                                           */
  __IOM uint32_t SCRATCH4_TGL;                  /**< SCRATCH4                                           */
  __IOM uint32_t SCRATCH5_TGL;                  /**< SCRATCH5                                           */
  __IOM uint32_t SCRATCH6_TGL;                  /**< SCRATCH6                                           */
  __IOM uint32_t SCRATCH7_TGL;                  /**< SCRATCH7                                           */
  uint32_t       RESERVED24[4U];                /**< Reserved for future use                            */
  __IOM uint32_t PRSMUXLSB_TGL;                 /**< New Register                                       */
  __IOM uint32_t PRSMUXMSB_TGL;                 /**< New Register                                       */
  __IOM uint32_t PRSOUT_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED25[1U];                /**< Reserved for future use                            */
  __IOM uint32_t RXEVMUX_TGL;                   /**< New Register                                       */
  __IOM uint32_t TIMCTRL_TGL;                   /**< New Register                                       */
  __IM uint32_t  TIMSTAT_TGL;                   /**< New Register                                       */
  uint32_t       RESERVED26[1U];                /**< Reserved for future use                            */
  __IOM uint32_t SHIFTS_TGL;                    /**< New Register                                       */
  __IOM uint32_t TXDONE_TGL;                    /**< New Register                                       */
} SMCTRL_TypeDef;
/** @} End of group EFR32FG25_SMCTRL */

/**************************************************************************//**
 * @addtogroup EFR32FG25_SMCTRL
 * @{
 * @defgroup EFR32FG25_SMCTRL_BitFields SMCTRL Bit Fields
 * @{
 *****************************************************************************/

