SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
/* Bit fields for SMCTRL IPVERSION */
#define _SMCTRL_IPVERSION_RESETVALUE              0x00000001UL                               /**< Default value for SMCTRL_IPVERSION          */
#define _SMCTRL_IPVERSION_MASK                    0xFFFFFFFFUL                               /**< Mask for SMCTRL_IPVERSION                   */
#define _SMCTRL_IPVERSION_IPVERSION_SHIFT         0                                          /**< Shift value for SMCTRL_IPVERSION            */
#define _SMCTRL_IPVERSION_IPVERSION_MASK          0xFFFFFFFFUL                               /**< Bit mask for SMCTRL_IPVERSION               */
#define _SMCTRL_IPVERSION_IPVERSION_DEFAULT       0x00000001UL                               /**< Mode DEFAULT for SMCTRL_IPVERSION           */
#define SMCTRL_IPVERSION_IPVERSION_DEFAULT        (_SMCTRL_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_IPVERSION   */

/* Bit fields for SMCTRL EN */
#define _SMCTRL_EN_RESETVALUE                     0x00000000UL                          /**< Default value for SMCTRL_EN                 */
#define _SMCTRL_EN_MASK                           0x00000003UL                          /**< Mask for SMCTRL_EN                          */
#define SMCTRL_EN_EN                              (0x1UL << 0)                          /**< Module Enable                               */
#define _SMCTRL_EN_EN_SHIFT                       0                                     /**< Shift value for SMCTRL_EN                   */
#define _SMCTRL_EN_EN_MASK                        0x1UL                                 /**< Bit mask for SMCTRL_EN                      */
#define _SMCTRL_EN_EN_DEFAULT                     0x00000000UL                          /**< Mode DEFAULT for SMCTRL_EN                  */
#define SMCTRL_EN_EN_DEFAULT                      (_SMCTRL_EN_EN_DEFAULT << 0)          /**< Shifted mode DEFAULT for SMCTRL_EN          */
#define SMCTRL_EN_DISABLING                       (0x1UL << 1)                          /**< Disablement Busy Status                     */
#define _SMCTRL_EN_DISABLING_SHIFT                1                                     /**< Shift value for SMCTRL_DISABLING            */
#define _SMCTRL_EN_DISABLING_MASK                 0x2UL                                 /**< Bit mask for SMCTRL_DISABLING               */
#define _SMCTRL_EN_DISABLING_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_EN                  */
#define SMCTRL_EN_DISABLING_DEFAULT               (_SMCTRL_EN_DISABLING_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMCTRL_EN          */

/* Bit fields for SMCTRL SWRST */
#define _SMCTRL_SWRST_RESETVALUE                  0x00000000UL                               /**< Default value for SMCTRL_SWRST              */
#define _SMCTRL_SWRST_MASK                        0x00000007UL                               /**< Mask for SMCTRL_SWRST                       */
#define SMCTRL_SWRST_SWRST                        (0x1UL << 0)                               /**< Software Reset Command                      */
#define _SMCTRL_SWRST_SWRST_SHIFT                 0                                          /**< Shift value for SMCTRL_SWRST                */
#define _SMCTRL_SWRST_SWRST_MASK                  0x1UL                                      /**< Bit mask for SMCTRL_SWRST                   */
#define _SMCTRL_SWRST_SWRST_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for SMCTRL_SWRST               */
#define SMCTRL_SWRST_SWRST_DEFAULT                (_SMCTRL_SWRST_SWRST_DEFAULT << 0)         /**< Shifted mode DEFAULT for SMCTRL_SWRST       */
#define SMCTRL_SWRST_RESETTING                    (0x1UL << 1)                               /**< Software Reset Busy Status                  */
#define _SMCTRL_SWRST_RESETTING_SHIFT             1                                          /**< Shift value for SMCTRL_RESETTING            */
#define _SMCTRL_SWRST_RESETTING_MASK              0x2UL                                      /**< Bit mask for SMCTRL_RESETTING               */
#define _SMCTRL_SWRST_RESETTING_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for SMCTRL_SWRST               */
#define SMCTRL_SWRST_RESETTING_DEFAULT            (_SMCTRL_SWRST_RESETTING_DEFAULT << 1)     /**< Shifted mode DEFAULT for SMCTRL_SWRST       */
#define SMCTRL_SWRST_COMBRESETTING                (0x1UL << 2)                               /**< Software Reset Busy Status (Combined)       */
#define _SMCTRL_SWRST_COMBRESETTING_SHIFT         2                                          /**< Shift value for SMCTRL_COMBRESETTING        */
#define _SMCTRL_SWRST_COMBRESETTING_MASK          0x4UL                                      /**< Bit mask for SMCTRL_COMBRESETTING           */
#define _SMCTRL_SWRST_COMBRESETTING_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for SMCTRL_SWRST               */
#define SMCTRL_SWRST_COMBRESETTING_DEFAULT        (_SMCTRL_SWRST_COMBRESETTING_DEFAULT << 2) /**< Shifted mode DEFAULT for SMCTRL_SWRST       */

/* Bit fields for SMCTRL MAINIF */
#define _SMCTRL_MAINIF_RESETVALUE                 0x00000000UL                            /**< Default value for SMCTRL_MAINIF             */
#define _SMCTRL_MAINIF_MASK                       0xFFFFFFFFUL                            /**< Mask for SMCTRL_MAINIF                      */
#define SMCTRL_MAINIF_MAINIF0                     (0x1UL << 0)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF0_SHIFT              0                                       /**< Shift value for SMCTRL_MAINIF0              */
#define _SMCTRL_MAINIF_MAINIF0_MASK               0x1UL                                   /**< Bit mask for SMCTRL_MAINIF0                 */
#define _SMCTRL_MAINIF_MAINIF0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF0_DEFAULT             (_SMCTRL_MAINIF_MAINIF0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF1                     (0x1UL << 1)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF1_SHIFT              1                                       /**< Shift value for SMCTRL_MAINIF1              */
#define _SMCTRL_MAINIF_MAINIF1_MASK               0x2UL                                   /**< Bit mask for SMCTRL_MAINIF1                 */
#define _SMCTRL_MAINIF_MAINIF1_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF1_DEFAULT             (_SMCTRL_MAINIF_MAINIF1_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF2                     (0x1UL << 2)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF2_SHIFT              2                                       /**< Shift value for SMCTRL_MAINIF2              */
#define _SMCTRL_MAINIF_MAINIF2_MASK               0x4UL                                   /**< Bit mask for SMCTRL_MAINIF2                 */
#define _SMCTRL_MAINIF_MAINIF2_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF2_DEFAULT             (_SMCTRL_MAINIF_MAINIF2_DEFAULT << 2)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF3                     (0x1UL << 3)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF3_SHIFT              3                                       /**< Shift value for SMCTRL_MAINIF3              */
#define _SMCTRL_MAINIF_MAINIF3_MASK               0x8UL                                   /**< Bit mask for SMCTRL_MAINIF3                 */
#define _SMCTRL_MAINIF_MAINIF3_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF3_DEFAULT             (_SMCTRL_MAINIF_MAINIF3_DEFAULT << 3)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF4                     (0x1UL << 4)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF4_SHIFT              4                                       /**< Shift value for SMCTRL_MAINIF4              */
#define _SMCTRL_MAINIF_MAINIF4_MASK               0x10UL                                  /**< Bit mask for SMCTRL_MAINIF4                 */
#define _SMCTRL_MAINIF_MAINIF4_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF4_DEFAULT             (_SMCTRL_MAINIF_MAINIF4_DEFAULT << 4)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF5                     (0x1UL << 5)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF5_SHIFT              5                                       /**< Shift value for SMCTRL_MAINIF5              */
#define _SMCTRL_MAINIF_MAINIF5_MASK               0x20UL                                  /**< Bit mask for SMCTRL_MAINIF5                 */
#define _SMCTRL_MAINIF_MAINIF5_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF5_DEFAULT             (_SMCTRL_MAINIF_MAINIF5_DEFAULT << 5)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF6                     (0x1UL << 6)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF6_SHIFT              6                                       /**< Shift value for SMCTRL_MAINIF6              */
#define _SMCTRL_MAINIF_MAINIF6_MASK               0x40UL                                  /**< Bit mask for SMCTRL_MAINIF6                 */
#define _SMCTRL_MAINIF_MAINIF6_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF6_DEFAULT             (_SMCTRL_MAINIF_MAINIF6_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF7                     (0x1UL << 7)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF7_SHIFT              7                                       /**< Shift value for SMCTRL_MAINIF7              */
#define _SMCTRL_MAINIF_MAINIF7_MASK               0x80UL                                  /**< Bit mask for SMCTRL_MAINIF7                 */
#define _SMCTRL_MAINIF_MAINIF7_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF7_DEFAULT             (_SMCTRL_MAINIF_MAINIF7_DEFAULT << 7)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF8                     (0x1UL << 8)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF8_SHIFT              8                                       /**< Shift value for SMCTRL_MAINIF8              */
#define _SMCTRL_MAINIF_MAINIF8_MASK               0x100UL                                 /**< Bit mask for SMCTRL_MAINIF8                 */
#define _SMCTRL_MAINIF_MAINIF8_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF8_DEFAULT             (_SMCTRL_MAINIF_MAINIF8_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF9                     (0x1UL << 9)                            /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF9_SHIFT              9                                       /**< Shift value for SMCTRL_MAINIF9              */
#define _SMCTRL_MAINIF_MAINIF9_MASK               0x200UL                                 /**< Bit mask for SMCTRL_MAINIF9                 */
#define _SMCTRL_MAINIF_MAINIF9_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF9_DEFAULT             (_SMCTRL_MAINIF_MAINIF9_DEFAULT << 9)   /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF10                    (0x1UL << 10)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF10_SHIFT             10                                      /**< Shift value for SMCTRL_MAINIF10             */
#define _SMCTRL_MAINIF_MAINIF10_MASK              0x400UL                                 /**< Bit mask for SMCTRL_MAINIF10                */
#define _SMCTRL_MAINIF_MAINIF10_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF10_DEFAULT            (_SMCTRL_MAINIF_MAINIF10_DEFAULT << 10) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF11                    (0x1UL << 11)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF11_SHIFT             11                                      /**< Shift value for SMCTRL_MAINIF11             */
#define _SMCTRL_MAINIF_MAINIF11_MASK              0x800UL                                 /**< Bit mask for SMCTRL_MAINIF11                */
#define _SMCTRL_MAINIF_MAINIF11_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF11_DEFAULT            (_SMCTRL_MAINIF_MAINIF11_DEFAULT << 11) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF12                    (0x1UL << 12)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF12_SHIFT             12                                      /**< Shift value for SMCTRL_MAINIF12             */
#define _SMCTRL_MAINIF_MAINIF12_MASK              0x1000UL                                /**< Bit mask for SMCTRL_MAINIF12                */
#define _SMCTRL_MAINIF_MAINIF12_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF12_DEFAULT            (_SMCTRL_MAINIF_MAINIF12_DEFAULT << 12) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF13                    (0x1UL << 13)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF13_SHIFT             13                                      /**< Shift value for SMCTRL_MAINIF13             */
#define _SMCTRL_MAINIF_MAINIF13_MASK              0x2000UL                                /**< Bit mask for SMCTRL_MAINIF13                */
#define _SMCTRL_MAINIF_MAINIF13_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF13_DEFAULT            (_SMCTRL_MAINIF_MAINIF13_DEFAULT << 13) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF14                    (0x1UL << 14)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF14_SHIFT             14                                      /**< Shift value for SMCTRL_MAINIF14             */
#define _SMCTRL_MAINIF_MAINIF14_MASK              0x4000UL                                /**< Bit mask for SMCTRL_MAINIF14                */
#define _SMCTRL_MAINIF_MAINIF14_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF14_DEFAULT            (_SMCTRL_MAINIF_MAINIF14_DEFAULT << 14) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF15                    (0x1UL << 15)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF15_SHIFT             15                                      /**< Shift value for SMCTRL_MAINIF15             */
#define _SMCTRL_MAINIF_MAINIF15_MASK              0x8000UL                                /**< Bit mask for SMCTRL_MAINIF15                */
#define _SMCTRL_MAINIF_MAINIF15_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF15_DEFAULT            (_SMCTRL_MAINIF_MAINIF15_DEFAULT << 15) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF16                    (0x1UL << 16)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF16_SHIFT             16                                      /**< Shift value for SMCTRL_MAINIF16             */
#define _SMCTRL_MAINIF_MAINIF16_MASK              0x10000UL                               /**< Bit mask for SMCTRL_MAINIF16                */
#define _SMCTRL_MAINIF_MAINIF16_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF16_DEFAULT            (_SMCTRL_MAINIF_MAINIF16_DEFAULT << 16) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF17                    (0x1UL << 17)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF17_SHIFT             17                                      /**< Shift value for SMCTRL_MAINIF17             */
#define _SMCTRL_MAINIF_MAINIF17_MASK              0x20000UL                               /**< Bit mask for SMCTRL_MAINIF17                */
#define _SMCTRL_MAINIF_MAINIF17_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF17_DEFAULT            (_SMCTRL_MAINIF_MAINIF17_DEFAULT << 17) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF18                    (0x1UL << 18)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF18_SHIFT             18                                      /**< Shift value for SMCTRL_MAINIF18             */
#define _SMCTRL_MAINIF_MAINIF18_MASK              0x40000UL                               /**< Bit mask for SMCTRL_MAINIF18                */
#define _SMCTRL_MAINIF_MAINIF18_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF18_DEFAULT            (_SMCTRL_MAINIF_MAINIF18_DEFAULT << 18) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF19                    (0x1UL << 19)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF19_SHIFT             19                                      /**< Shift value for SMCTRL_MAINIF19             */
#define _SMCTRL_MAINIF_MAINIF19_MASK              0x80000UL                               /**< Bit mask for SMCTRL_MAINIF19                */
#define _SMCTRL_MAINIF_MAINIF19_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF19_DEFAULT            (_SMCTRL_MAINIF_MAINIF19_DEFAULT << 19) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF20                    (0x1UL << 20)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF20_SHIFT             20                                      /**< Shift value for SMCTRL_MAINIF20             */
#define _SMCTRL_MAINIF_MAINIF20_MASK              0x100000UL                              /**< Bit mask for SMCTRL_MAINIF20                */
#define _SMCTRL_MAINIF_MAINIF20_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF20_DEFAULT            (_SMCTRL_MAINIF_MAINIF20_DEFAULT << 20) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF21                    (0x1UL << 21)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF21_SHIFT             21                                      /**< Shift value for SMCTRL_MAINIF21             */
#define _SMCTRL_MAINIF_MAINIF21_MASK              0x200000UL                              /**< Bit mask for SMCTRL_MAINIF21                */
#define _SMCTRL_MAINIF_MAINIF21_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF21_DEFAULT            (_SMCTRL_MAINIF_MAINIF21_DEFAULT << 21) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF22                    (0x1UL << 22)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF22_SHIFT             22                                      /**< Shift value for SMCTRL_MAINIF22             */
#define _SMCTRL_MAINIF_MAINIF22_MASK              0x400000UL                              /**< Bit mask for SMCTRL_MAINIF22                */
#define _SMCTRL_MAINIF_MAINIF22_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF22_DEFAULT            (_SMCTRL_MAINIF_MAINIF22_DEFAULT << 22) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF23                    (0x1UL << 23)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF23_SHIFT             23                                      /**< Shift value for SMCTRL_MAINIF23             */
#define _SMCTRL_MAINIF_MAINIF23_MASK              0x800000UL                              /**< Bit mask for SMCTRL_MAINIF23                */
#define _SMCTRL_MAINIF_MAINIF23_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF23_DEFAULT            (_SMCTRL_MAINIF_MAINIF23_DEFAULT << 23) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF24                    (0x1UL << 24)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF24_SHIFT             24                                      /**< Shift value for SMCTRL_MAINIF24             */
#define _SMCTRL_MAINIF_MAINIF24_MASK              0x1000000UL                             /**< Bit mask for SMCTRL_MAINIF24                */
#define _SMCTRL_MAINIF_MAINIF24_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF24_DEFAULT            (_SMCTRL_MAINIF_MAINIF24_DEFAULT << 24) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF25                    (0x1UL << 25)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF25_SHIFT             25                                      /**< Shift value for SMCTRL_MAINIF25             */
#define _SMCTRL_MAINIF_MAINIF25_MASK              0x2000000UL                             /**< Bit mask for SMCTRL_MAINIF25                */
#define _SMCTRL_MAINIF_MAINIF25_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF25_DEFAULT            (_SMCTRL_MAINIF_MAINIF25_DEFAULT << 25) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
