SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
#define SMCTRL_MAINIF_MAINIF26                    (0x1UL << 26)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF26_SHIFT             26                                      /**< Shift value for SMCTRL_MAINIF26             */
#define _SMCTRL_MAINIF_MAINIF26_MASK              0x4000000UL                             /**< Bit mask for SMCTRL_MAINIF26                */
#define _SMCTRL_MAINIF_MAINIF26_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF26_DEFAULT            (_SMCTRL_MAINIF_MAINIF26_DEFAULT << 26) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF27                    (0x1UL << 27)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF27_SHIFT             27                                      /**< Shift value for SMCTRL_MAINIF27             */
#define _SMCTRL_MAINIF_MAINIF27_MASK              0x8000000UL                             /**< Bit mask for SMCTRL_MAINIF27                */
#define _SMCTRL_MAINIF_MAINIF27_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF27_DEFAULT            (_SMCTRL_MAINIF_MAINIF27_DEFAULT << 27) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF28                    (0x1UL << 28)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF28_SHIFT             28                                      /**< Shift value for SMCTRL_MAINIF28             */
#define _SMCTRL_MAINIF_MAINIF28_MASK              0x10000000UL                            /**< Bit mask for SMCTRL_MAINIF28                */
#define _SMCTRL_MAINIF_MAINIF28_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF28_DEFAULT            (_SMCTRL_MAINIF_MAINIF28_DEFAULT << 28) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF29                    (0x1UL << 29)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF29_SHIFT             29                                      /**< Shift value for SMCTRL_MAINIF29             */
#define _SMCTRL_MAINIF_MAINIF29_MASK              0x20000000UL                            /**< Bit mask for SMCTRL_MAINIF29                */
#define _SMCTRL_MAINIF_MAINIF29_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF29_DEFAULT            (_SMCTRL_MAINIF_MAINIF29_DEFAULT << 29) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF30                    (0x1UL << 30)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF30_SHIFT             30                                      /**< Shift value for SMCTRL_MAINIF30             */
#define _SMCTRL_MAINIF_MAINIF30_MASK              0x40000000UL                            /**< Bit mask for SMCTRL_MAINIF30                */
#define _SMCTRL_MAINIF_MAINIF30_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF30_DEFAULT            (_SMCTRL_MAINIF_MAINIF30_DEFAULT << 30) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */
#define SMCTRL_MAINIF_MAINIF31                    (0x1UL << 31)                           /**< Main CPU Interupt Flag                      */
#define _SMCTRL_MAINIF_MAINIF31_SHIFT             31                                      /**< Shift value for SMCTRL_MAINIF31             */
#define _SMCTRL_MAINIF_MAINIF31_MASK              0x80000000UL                            /**< Bit mask for SMCTRL_MAINIF31                */
#define _SMCTRL_MAINIF_MAINIF31_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_MAINIF              */
#define SMCTRL_MAINIF_MAINIF31_DEFAULT            (_SMCTRL_MAINIF_MAINIF31_DEFAULT << 31) /**< Shifted mode DEFAULT for SMCTRL_MAINIF      */

/* Bit fields for SMCTRL MAINIEN */
#define _SMCTRL_MAINIEN_RESETVALUE                0x00000000UL                              /**< Default value for SMCTRL_MAINIEN            */
#define _SMCTRL_MAINIEN_MASK                      0xFFFFFFFFUL                              /**< Mask for SMCTRL_MAINIEN                     */
#define SMCTRL_MAINIEN_MAINIEN0                   (0x1UL << 0)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN0_SHIFT            0                                         /**< Shift value for SMCTRL_MAINIEN0             */
#define _SMCTRL_MAINIEN_MAINIEN0_MASK             0x1UL                                     /**< Bit mask for SMCTRL_MAINIEN0                */
#define _SMCTRL_MAINIEN_MAINIEN0_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN0_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN1                   (0x1UL << 1)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN1_SHIFT            1                                         /**< Shift value for SMCTRL_MAINIEN1             */
#define _SMCTRL_MAINIEN_MAINIEN1_MASK             0x2UL                                     /**< Bit mask for SMCTRL_MAINIEN1                */
#define _SMCTRL_MAINIEN_MAINIEN1_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN1_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN1_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN2                   (0x1UL << 2)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN2_SHIFT            2                                         /**< Shift value for SMCTRL_MAINIEN2             */
#define _SMCTRL_MAINIEN_MAINIEN2_MASK             0x4UL                                     /**< Bit mask for SMCTRL_MAINIEN2                */
#define _SMCTRL_MAINIEN_MAINIEN2_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN2_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN2_DEFAULT << 2)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN3                   (0x1UL << 3)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN3_SHIFT            3                                         /**< Shift value for SMCTRL_MAINIEN3             */
#define _SMCTRL_MAINIEN_MAINIEN3_MASK             0x8UL                                     /**< Bit mask for SMCTRL_MAINIEN3                */
#define _SMCTRL_MAINIEN_MAINIEN3_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN3_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN3_DEFAULT << 3)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN4                   (0x1UL << 4)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN4_SHIFT            4                                         /**< Shift value for SMCTRL_MAINIEN4             */
#define _SMCTRL_MAINIEN_MAINIEN4_MASK             0x10UL                                    /**< Bit mask for SMCTRL_MAINIEN4                */
#define _SMCTRL_MAINIEN_MAINIEN4_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN4_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN4_DEFAULT << 4)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN5                   (0x1UL << 5)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN5_SHIFT            5                                         /**< Shift value for SMCTRL_MAINIEN5             */
#define _SMCTRL_MAINIEN_MAINIEN5_MASK             0x20UL                                    /**< Bit mask for SMCTRL_MAINIEN5                */
#define _SMCTRL_MAINIEN_MAINIEN5_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN5_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN5_DEFAULT << 5)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN6                   (0x1UL << 6)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN6_SHIFT            6                                         /**< Shift value for SMCTRL_MAINIEN6             */
#define _SMCTRL_MAINIEN_MAINIEN6_MASK             0x40UL                                    /**< Bit mask for SMCTRL_MAINIEN6                */
#define _SMCTRL_MAINIEN_MAINIEN6_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN6_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN6_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN7                   (0x1UL << 7)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN7_SHIFT            7                                         /**< Shift value for SMCTRL_MAINIEN7             */
#define _SMCTRL_MAINIEN_MAINIEN7_MASK             0x80UL                                    /**< Bit mask for SMCTRL_MAINIEN7                */
#define _SMCTRL_MAINIEN_MAINIEN7_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN7_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN7_DEFAULT << 7)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN8                   (0x1UL << 8)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN8_SHIFT            8                                         /**< Shift value for SMCTRL_MAINIEN8             */
#define _SMCTRL_MAINIEN_MAINIEN8_MASK             0x100UL                                   /**< Bit mask for SMCTRL_MAINIEN8                */
#define _SMCTRL_MAINIEN_MAINIEN8_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN8_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN8_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN9                   (0x1UL << 9)                              /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN9_SHIFT            9                                         /**< Shift value for SMCTRL_MAINIEN9             */
#define _SMCTRL_MAINIEN_MAINIEN9_MASK             0x200UL                                   /**< Bit mask for SMCTRL_MAINIEN9                */
#define _SMCTRL_MAINIEN_MAINIEN9_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN9_DEFAULT           (_SMCTRL_MAINIEN_MAINIEN9_DEFAULT << 9)   /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN10                  (0x1UL << 10)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN10_SHIFT           10                                        /**< Shift value for SMCTRL_MAINIEN10            */
#define _SMCTRL_MAINIEN_MAINIEN10_MASK            0x400UL                                   /**< Bit mask for SMCTRL_MAINIEN10               */
#define _SMCTRL_MAINIEN_MAINIEN10_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN10_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN10_DEFAULT << 10) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN11                  (0x1UL << 11)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN11_SHIFT           11                                        /**< Shift value for SMCTRL_MAINIEN11            */
#define _SMCTRL_MAINIEN_MAINIEN11_MASK            0x800UL                                   /**< Bit mask for SMCTRL_MAINIEN11               */
#define _SMCTRL_MAINIEN_MAINIEN11_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN11_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN11_DEFAULT << 11) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN12                  (0x1UL << 12)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN12_SHIFT           12                                        /**< Shift value for SMCTRL_MAINIEN12            */
#define _SMCTRL_MAINIEN_MAINIEN12_MASK            0x1000UL                                  /**< Bit mask for SMCTRL_MAINIEN12               */
#define _SMCTRL_MAINIEN_MAINIEN12_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN12_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN12_DEFAULT << 12) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN13                  (0x1UL << 13)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN13_SHIFT           13                                        /**< Shift value for SMCTRL_MAINIEN13            */
#define _SMCTRL_MAINIEN_MAINIEN13_MASK            0x2000UL                                  /**< Bit mask for SMCTRL_MAINIEN13               */
#define _SMCTRL_MAINIEN_MAINIEN13_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN13_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN13_DEFAULT << 13) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN14                  (0x1UL << 14)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN14_SHIFT           14                                        /**< Shift value for SMCTRL_MAINIEN14            */
#define _SMCTRL_MAINIEN_MAINIEN14_MASK            0x4000UL                                  /**< Bit mask for SMCTRL_MAINIEN14               */
#define _SMCTRL_MAINIEN_MAINIEN14_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN14_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN14_DEFAULT << 14) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN15                  (0x1UL << 15)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN15_SHIFT           15                                        /**< Shift value for SMCTRL_MAINIEN15            */
#define _SMCTRL_MAINIEN_MAINIEN15_MASK            0x8000UL                                  /**< Bit mask for SMCTRL_MAINIEN15               */
#define _SMCTRL_MAINIEN_MAINIEN15_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN15_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN15_DEFAULT << 15) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN16                  (0x1UL << 16)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN16_SHIFT           16                                        /**< Shift value for SMCTRL_MAINIEN16            */
#define _SMCTRL_MAINIEN_MAINIEN16_MASK            0x10000UL                                 /**< Bit mask for SMCTRL_MAINIEN16               */
#define _SMCTRL_MAINIEN_MAINIEN16_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN16_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN16_DEFAULT << 16) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN17                  (0x1UL << 17)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN17_SHIFT           17                                        /**< Shift value for SMCTRL_MAINIEN17            */
#define _SMCTRL_MAINIEN_MAINIEN17_MASK            0x20000UL                                 /**< Bit mask for SMCTRL_MAINIEN17               */
#define _SMCTRL_MAINIEN_MAINIEN17_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN17_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN17_DEFAULT << 17) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN18                  (0x1UL << 18)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN18_SHIFT           18                                        /**< Shift value for SMCTRL_MAINIEN18            */
#define _SMCTRL_MAINIEN_MAINIEN18_MASK            0x40000UL                                 /**< Bit mask for SMCTRL_MAINIEN18               */
#define _SMCTRL_MAINIEN_MAINIEN18_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN18_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN18_DEFAULT << 18) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN19                  (0x1UL << 19)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN19_SHIFT           19                                        /**< Shift value for SMCTRL_MAINIEN19            */
#define _SMCTRL_MAINIEN_MAINIEN19_MASK            0x80000UL                                 /**< Bit mask for SMCTRL_MAINIEN19               */
#define _SMCTRL_MAINIEN_MAINIEN19_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN19_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN19_DEFAULT << 19) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN20                  (0x1UL << 20)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN20_SHIFT           20                                        /**< Shift value for SMCTRL_MAINIEN20            */
#define _SMCTRL_MAINIEN_MAINIEN20_MASK            0x100000UL                                /**< Bit mask for SMCTRL_MAINIEN20               */
#define _SMCTRL_MAINIEN_MAINIEN20_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN20_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN20_DEFAULT << 20) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN21                  (0x1UL << 21)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN21_SHIFT           21                                        /**< Shift value for SMCTRL_MAINIEN21            */
#define _SMCTRL_MAINIEN_MAINIEN21_MASK            0x200000UL                                /**< Bit mask for SMCTRL_MAINIEN21               */
#define _SMCTRL_MAINIEN_MAINIEN21_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN21_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN21_DEFAULT << 21) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN22                  (0x1UL << 22)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN22_SHIFT           22                                        /**< Shift value for SMCTRL_MAINIEN22            */
#define _SMCTRL_MAINIEN_MAINIEN22_MASK            0x400000UL                                /**< Bit mask for SMCTRL_MAINIEN22               */
#define _SMCTRL_MAINIEN_MAINIEN22_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN22_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN22_DEFAULT << 22) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN23                  (0x1UL << 23)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN23_SHIFT           23                                        /**< Shift value for SMCTRL_MAINIEN23            */
#define _SMCTRL_MAINIEN_MAINIEN23_MASK            0x800000UL                                /**< Bit mask for SMCTRL_MAINIEN23               */
#define _SMCTRL_MAINIEN_MAINIEN23_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN23_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN23_DEFAULT << 23) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN24                  (0x1UL << 24)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN24_SHIFT           24                                        /**< Shift value for SMCTRL_MAINIEN24            */
#define _SMCTRL_MAINIEN_MAINIEN24_MASK            0x1000000UL                               /**< Bit mask for SMCTRL_MAINIEN24               */
#define _SMCTRL_MAINIEN_MAINIEN24_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN24_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN24_DEFAULT << 24) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN25                  (0x1UL << 25)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN25_SHIFT           25                                        /**< Shift value for SMCTRL_MAINIEN25            */
#define _SMCTRL_MAINIEN_MAINIEN25_MASK            0x2000000UL                               /**< Bit mask for SMCTRL_MAINIEN25               */
#define _SMCTRL_MAINIEN_MAINIEN25_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN25_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN25_DEFAULT << 25) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN26                  (0x1UL << 26)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN26_SHIFT           26                                        /**< Shift value for SMCTRL_MAINIEN26            */
#define _SMCTRL_MAINIEN_MAINIEN26_MASK            0x4000000UL                               /**< Bit mask for SMCTRL_MAINIEN26               */
#define _SMCTRL_MAINIEN_MAINIEN26_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
