SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
#define SMCTRL_MAINIEN_MAINIEN26_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN26_DEFAULT << 26) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN27                  (0x1UL << 27)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN27_SHIFT           27                                        /**< Shift value for SMCTRL_MAINIEN27            */
#define _SMCTRL_MAINIEN_MAINIEN27_MASK            0x8000000UL                               /**< Bit mask for SMCTRL_MAINIEN27               */
#define _SMCTRL_MAINIEN_MAINIEN27_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN27_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN27_DEFAULT << 27) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN28                  (0x1UL << 28)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN28_SHIFT           28                                        /**< Shift value for SMCTRL_MAINIEN28            */
#define _SMCTRL_MAINIEN_MAINIEN28_MASK            0x10000000UL                              /**< Bit mask for SMCTRL_MAINIEN28               */
#define _SMCTRL_MAINIEN_MAINIEN28_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN28_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN28_DEFAULT << 28) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN29                  (0x1UL << 29)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN29_SHIFT           29                                        /**< Shift value for SMCTRL_MAINIEN29            */
#define _SMCTRL_MAINIEN_MAINIEN29_MASK            0x20000000UL                              /**< Bit mask for SMCTRL_MAINIEN29               */
#define _SMCTRL_MAINIEN_MAINIEN29_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN29_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN29_DEFAULT << 29) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN30                  (0x1UL << 30)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN30_SHIFT           30                                        /**< Shift value for SMCTRL_MAINIEN30            */
#define _SMCTRL_MAINIEN_MAINIEN30_MASK            0x40000000UL                              /**< Bit mask for SMCTRL_MAINIEN30               */
#define _SMCTRL_MAINIEN_MAINIEN30_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN30_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN30_DEFAULT << 30) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */
#define SMCTRL_MAINIEN_MAINIEN31                  (0x1UL << 31)                             /**< Main CPU Interrupt Enable                   */
#define _SMCTRL_MAINIEN_MAINIEN31_SHIFT           31                                        /**< Shift value for SMCTRL_MAINIEN31            */
#define _SMCTRL_MAINIEN_MAINIEN31_MASK            0x80000000UL                              /**< Bit mask for SMCTRL_MAINIEN31               */
#define _SMCTRL_MAINIEN_MAINIEN31_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMCTRL_MAINIEN             */
#define SMCTRL_MAINIEN_MAINIEN31_DEFAULT          (_SMCTRL_MAINIEN_MAINIEN31_DEFAULT << 31) /**< Shifted mode DEFAULT for SMCTRL_MAINIEN     */

/* Bit fields for SMCTRL SEQIF */
#define _SMCTRL_SEQIF_RESETVALUE                  0x00000000UL                          /**< Default value for SMCTRL_SEQIF              */
#define _SMCTRL_SEQIF_MASK                        0xFFFFFFFFUL                          /**< Mask for SMCTRL_SEQIF                       */
#define SMCTRL_SEQIF_SEQIF0                       (0x1UL << 0)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF0_SHIFT                0                                     /**< Shift value for SMCTRL_SEQIF0               */
#define _SMCTRL_SEQIF_SEQIF0_MASK                 0x1UL                                 /**< Bit mask for SMCTRL_SEQIF0                  */
#define _SMCTRL_SEQIF_SEQIF0_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF0_DEFAULT               (_SMCTRL_SEQIF_SEQIF0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF1                       (0x1UL << 1)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF1_SHIFT                1                                     /**< Shift value for SMCTRL_SEQIF1               */
#define _SMCTRL_SEQIF_SEQIF1_MASK                 0x2UL                                 /**< Bit mask for SMCTRL_SEQIF1                  */
#define _SMCTRL_SEQIF_SEQIF1_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF1_DEFAULT               (_SMCTRL_SEQIF_SEQIF1_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF2                       (0x1UL << 2)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF2_SHIFT                2                                     /**< Shift value for SMCTRL_SEQIF2               */
#define _SMCTRL_SEQIF_SEQIF2_MASK                 0x4UL                                 /**< Bit mask for SMCTRL_SEQIF2                  */
#define _SMCTRL_SEQIF_SEQIF2_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF2_DEFAULT               (_SMCTRL_SEQIF_SEQIF2_DEFAULT << 2)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF3                       (0x1UL << 3)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF3_SHIFT                3                                     /**< Shift value for SMCTRL_SEQIF3               */
#define _SMCTRL_SEQIF_SEQIF3_MASK                 0x8UL                                 /**< Bit mask for SMCTRL_SEQIF3                  */
#define _SMCTRL_SEQIF_SEQIF3_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF3_DEFAULT               (_SMCTRL_SEQIF_SEQIF3_DEFAULT << 3)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF4                       (0x1UL << 4)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF4_SHIFT                4                                     /**< Shift value for SMCTRL_SEQIF4               */
#define _SMCTRL_SEQIF_SEQIF4_MASK                 0x10UL                                /**< Bit mask for SMCTRL_SEQIF4                  */
#define _SMCTRL_SEQIF_SEQIF4_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF4_DEFAULT               (_SMCTRL_SEQIF_SEQIF4_DEFAULT << 4)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF5                       (0x1UL << 5)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF5_SHIFT                5                                     /**< Shift value for SMCTRL_SEQIF5               */
#define _SMCTRL_SEQIF_SEQIF5_MASK                 0x20UL                                /**< Bit mask for SMCTRL_SEQIF5                  */
#define _SMCTRL_SEQIF_SEQIF5_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF5_DEFAULT               (_SMCTRL_SEQIF_SEQIF5_DEFAULT << 5)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF6                       (0x1UL << 6)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF6_SHIFT                6                                     /**< Shift value for SMCTRL_SEQIF6               */
#define _SMCTRL_SEQIF_SEQIF6_MASK                 0x40UL                                /**< Bit mask for SMCTRL_SEQIF6                  */
#define _SMCTRL_SEQIF_SEQIF6_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF6_DEFAULT               (_SMCTRL_SEQIF_SEQIF6_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF7                       (0x1UL << 7)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF7_SHIFT                7                                     /**< Shift value for SMCTRL_SEQIF7               */
#define _SMCTRL_SEQIF_SEQIF7_MASK                 0x80UL                                /**< Bit mask for SMCTRL_SEQIF7                  */
#define _SMCTRL_SEQIF_SEQIF7_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF7_DEFAULT               (_SMCTRL_SEQIF_SEQIF7_DEFAULT << 7)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF8                       (0x1UL << 8)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF8_SHIFT                8                                     /**< Shift value for SMCTRL_SEQIF8               */
#define _SMCTRL_SEQIF_SEQIF8_MASK                 0x100UL                               /**< Bit mask for SMCTRL_SEQIF8                  */
#define _SMCTRL_SEQIF_SEQIF8_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF8_DEFAULT               (_SMCTRL_SEQIF_SEQIF8_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF9                       (0x1UL << 9)                          /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF9_SHIFT                9                                     /**< Shift value for SMCTRL_SEQIF9               */
#define _SMCTRL_SEQIF_SEQIF9_MASK                 0x200UL                               /**< Bit mask for SMCTRL_SEQIF9                  */
#define _SMCTRL_SEQIF_SEQIF9_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF9_DEFAULT               (_SMCTRL_SEQIF_SEQIF9_DEFAULT << 9)   /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF10                      (0x1UL << 10)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF10_SHIFT               10                                    /**< Shift value for SMCTRL_SEQIF10              */
#define _SMCTRL_SEQIF_SEQIF10_MASK                0x400UL                               /**< Bit mask for SMCTRL_SEQIF10                 */
#define _SMCTRL_SEQIF_SEQIF10_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF10_DEFAULT              (_SMCTRL_SEQIF_SEQIF10_DEFAULT << 10) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF11                      (0x1UL << 11)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF11_SHIFT               11                                    /**< Shift value for SMCTRL_SEQIF11              */
#define _SMCTRL_SEQIF_SEQIF11_MASK                0x800UL                               /**< Bit mask for SMCTRL_SEQIF11                 */
#define _SMCTRL_SEQIF_SEQIF11_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF11_DEFAULT              (_SMCTRL_SEQIF_SEQIF11_DEFAULT << 11) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF12                      (0x1UL << 12)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF12_SHIFT               12                                    /**< Shift value for SMCTRL_SEQIF12              */
#define _SMCTRL_SEQIF_SEQIF12_MASK                0x1000UL                              /**< Bit mask for SMCTRL_SEQIF12                 */
#define _SMCTRL_SEQIF_SEQIF12_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF12_DEFAULT              (_SMCTRL_SEQIF_SEQIF12_DEFAULT << 12) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF13                      (0x1UL << 13)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF13_SHIFT               13                                    /**< Shift value for SMCTRL_SEQIF13              */
#define _SMCTRL_SEQIF_SEQIF13_MASK                0x2000UL                              /**< Bit mask for SMCTRL_SEQIF13                 */
#define _SMCTRL_SEQIF_SEQIF13_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF13_DEFAULT              (_SMCTRL_SEQIF_SEQIF13_DEFAULT << 13) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF14                      (0x1UL << 14)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF14_SHIFT               14                                    /**< Shift value for SMCTRL_SEQIF14              */
#define _SMCTRL_SEQIF_SEQIF14_MASK                0x4000UL                              /**< Bit mask for SMCTRL_SEQIF14                 */
#define _SMCTRL_SEQIF_SEQIF14_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF14_DEFAULT              (_SMCTRL_SEQIF_SEQIF14_DEFAULT << 14) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF15                      (0x1UL << 15)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF15_SHIFT               15                                    /**< Shift value for SMCTRL_SEQIF15              */
#define _SMCTRL_SEQIF_SEQIF15_MASK                0x8000UL                              /**< Bit mask for SMCTRL_SEQIF15                 */
#define _SMCTRL_SEQIF_SEQIF15_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF15_DEFAULT              (_SMCTRL_SEQIF_SEQIF15_DEFAULT << 15) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF16                      (0x1UL << 16)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF16_SHIFT               16                                    /**< Shift value for SMCTRL_SEQIF16              */
#define _SMCTRL_SEQIF_SEQIF16_MASK                0x10000UL                             /**< Bit mask for SMCTRL_SEQIF16                 */
#define _SMCTRL_SEQIF_SEQIF16_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF16_DEFAULT              (_SMCTRL_SEQIF_SEQIF16_DEFAULT << 16) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF17                      (0x1UL << 17)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF17_SHIFT               17                                    /**< Shift value for SMCTRL_SEQIF17              */
#define _SMCTRL_SEQIF_SEQIF17_MASK                0x20000UL                             /**< Bit mask for SMCTRL_SEQIF17                 */
#define _SMCTRL_SEQIF_SEQIF17_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF17_DEFAULT              (_SMCTRL_SEQIF_SEQIF17_DEFAULT << 17) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF18                      (0x1UL << 18)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF18_SHIFT               18                                    /**< Shift value for SMCTRL_SEQIF18              */
#define _SMCTRL_SEQIF_SEQIF18_MASK                0x40000UL                             /**< Bit mask for SMCTRL_SEQIF18                 */
#define _SMCTRL_SEQIF_SEQIF18_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF18_DEFAULT              (_SMCTRL_SEQIF_SEQIF18_DEFAULT << 18) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF19                      (0x1UL << 19)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF19_SHIFT               19                                    /**< Shift value for SMCTRL_SEQIF19              */
#define _SMCTRL_SEQIF_SEQIF19_MASK                0x80000UL                             /**< Bit mask for SMCTRL_SEQIF19                 */
#define _SMCTRL_SEQIF_SEQIF19_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF19_DEFAULT              (_SMCTRL_SEQIF_SEQIF19_DEFAULT << 19) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF20                      (0x1UL << 20)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF20_SHIFT               20                                    /**< Shift value for SMCTRL_SEQIF20              */
#define _SMCTRL_SEQIF_SEQIF20_MASK                0x100000UL                            /**< Bit mask for SMCTRL_SEQIF20                 */
#define _SMCTRL_SEQIF_SEQIF20_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF20_DEFAULT              (_SMCTRL_SEQIF_SEQIF20_DEFAULT << 20) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF21                      (0x1UL << 21)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF21_SHIFT               21                                    /**< Shift value for SMCTRL_SEQIF21              */
#define _SMCTRL_SEQIF_SEQIF21_MASK                0x200000UL                            /**< Bit mask for SMCTRL_SEQIF21                 */
#define _SMCTRL_SEQIF_SEQIF21_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF21_DEFAULT              (_SMCTRL_SEQIF_SEQIF21_DEFAULT << 21) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF22                      (0x1UL << 22)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF22_SHIFT               22                                    /**< Shift value for SMCTRL_SEQIF22              */
#define _SMCTRL_SEQIF_SEQIF22_MASK                0x400000UL                            /**< Bit mask for SMCTRL_SEQIF22                 */
#define _SMCTRL_SEQIF_SEQIF22_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF22_DEFAULT              (_SMCTRL_SEQIF_SEQIF22_DEFAULT << 22) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF23                      (0x1UL << 23)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF23_SHIFT               23                                    /**< Shift value for SMCTRL_SEQIF23              */
#define _SMCTRL_SEQIF_SEQIF23_MASK                0x800000UL                            /**< Bit mask for SMCTRL_SEQIF23                 */
#define _SMCTRL_SEQIF_SEQIF23_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF23_DEFAULT              (_SMCTRL_SEQIF_SEQIF23_DEFAULT << 23) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF24                      (0x1UL << 24)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF24_SHIFT               24                                    /**< Shift value for SMCTRL_SEQIF24              */
#define _SMCTRL_SEQIF_SEQIF24_MASK                0x1000000UL                           /**< Bit mask for SMCTRL_SEQIF24                 */
#define _SMCTRL_SEQIF_SEQIF24_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF24_DEFAULT              (_SMCTRL_SEQIF_SEQIF24_DEFAULT << 24) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF25                      (0x1UL << 25)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF25_SHIFT               25                                    /**< Shift value for SMCTRL_SEQIF25              */
#define _SMCTRL_SEQIF_SEQIF25_MASK                0x2000000UL                           /**< Bit mask for SMCTRL_SEQIF25                 */
#define _SMCTRL_SEQIF_SEQIF25_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF25_DEFAULT              (_SMCTRL_SEQIF_SEQIF25_DEFAULT << 25) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF26                      (0x1UL << 26)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF26_SHIFT               26                                    /**< Shift value for SMCTRL_SEQIF26              */
#define _SMCTRL_SEQIF_SEQIF26_MASK                0x4000000UL                           /**< Bit mask for SMCTRL_SEQIF26                 */
#define _SMCTRL_SEQIF_SEQIF26_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF26_DEFAULT              (_SMCTRL_SEQIF_SEQIF26_DEFAULT << 26) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF27                      (0x1UL << 27)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF27_SHIFT               27                                    /**< Shift value for SMCTRL_SEQIF27              */
#define _SMCTRL_SEQIF_SEQIF27_MASK                0x8000000UL                           /**< Bit mask for SMCTRL_SEQIF27                 */
#define _SMCTRL_SEQIF_SEQIF27_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF27_DEFAULT              (_SMCTRL_SEQIF_SEQIF27_DEFAULT << 27) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF28                      (0x1UL << 28)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF28_SHIFT               28                                    /**< Shift value for SMCTRL_SEQIF28              */
