SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
#define _SMCTRL_SEQIF_SEQIF28_MASK                0x10000000UL                          /**< Bit mask for SMCTRL_SEQIF28                 */
#define _SMCTRL_SEQIF_SEQIF28_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF28_DEFAULT              (_SMCTRL_SEQIF_SEQIF28_DEFAULT << 28) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF29                      (0x1UL << 29)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF29_SHIFT               29                                    /**< Shift value for SMCTRL_SEQIF29              */
#define _SMCTRL_SEQIF_SEQIF29_MASK                0x20000000UL                          /**< Bit mask for SMCTRL_SEQIF29                 */
#define _SMCTRL_SEQIF_SEQIF29_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF29_DEFAULT              (_SMCTRL_SEQIF_SEQIF29_DEFAULT << 29) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF30                      (0x1UL << 30)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF30_SHIFT               30                                    /**< Shift value for SMCTRL_SEQIF30              */
#define _SMCTRL_SEQIF_SEQIF30_MASK                0x40000000UL                          /**< Bit mask for SMCTRL_SEQIF30                 */
#define _SMCTRL_SEQIF_SEQIF30_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF30_DEFAULT              (_SMCTRL_SEQIF_SEQIF30_DEFAULT << 30) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */
#define SMCTRL_SEQIF_SEQIF31                      (0x1UL << 31)                         /**< Sequencer Interupt Flag                     */
#define _SMCTRL_SEQIF_SEQIF31_SHIFT               31                                    /**< Shift value for SMCTRL_SEQIF31              */
#define _SMCTRL_SEQIF_SEQIF31_MASK                0x80000000UL                          /**< Bit mask for SMCTRL_SEQIF31                 */
#define _SMCTRL_SEQIF_SEQIF31_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SEQIF               */
#define SMCTRL_SEQIF_SEQIF31_DEFAULT              (_SMCTRL_SEQIF_SEQIF31_DEFAULT << 31) /**< Shifted mode DEFAULT for SMCTRL_SEQIF       */

/* Bit fields for SMCTRL SEQIEN */
#define _SMCTRL_SEQIEN_RESETVALUE                 0x00000000UL                            /**< Default value for SMCTRL_SEQIEN             */
#define _SMCTRL_SEQIEN_MASK                       0xFFFFFFFFUL                            /**< Mask for SMCTRL_SEQIEN                      */
#define SMCTRL_SEQIEN_SEQIEN0                     (0x1UL << 0)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN0_SHIFT              0                                       /**< Shift value for SMCTRL_SEQIEN0              */
#define _SMCTRL_SEQIEN_SEQIEN0_MASK               0x1UL                                   /**< Bit mask for SMCTRL_SEQIEN0                 */
#define _SMCTRL_SEQIEN_SEQIEN0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN0_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN1                     (0x1UL << 1)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN1_SHIFT              1                                       /**< Shift value for SMCTRL_SEQIEN1              */
#define _SMCTRL_SEQIEN_SEQIEN1_MASK               0x2UL                                   /**< Bit mask for SMCTRL_SEQIEN1                 */
#define _SMCTRL_SEQIEN_SEQIEN1_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN1_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN1_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN2                     (0x1UL << 2)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN2_SHIFT              2                                       /**< Shift value for SMCTRL_SEQIEN2              */
#define _SMCTRL_SEQIEN_SEQIEN2_MASK               0x4UL                                   /**< Bit mask for SMCTRL_SEQIEN2                 */
#define _SMCTRL_SEQIEN_SEQIEN2_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN2_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN2_DEFAULT << 2)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN3                     (0x1UL << 3)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN3_SHIFT              3                                       /**< Shift value for SMCTRL_SEQIEN3              */
#define _SMCTRL_SEQIEN_SEQIEN3_MASK               0x8UL                                   /**< Bit mask for SMCTRL_SEQIEN3                 */
#define _SMCTRL_SEQIEN_SEQIEN3_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN3_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN3_DEFAULT << 3)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN4                     (0x1UL << 4)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN4_SHIFT              4                                       /**< Shift value for SMCTRL_SEQIEN4              */
#define _SMCTRL_SEQIEN_SEQIEN4_MASK               0x10UL                                  /**< Bit mask for SMCTRL_SEQIEN4                 */
#define _SMCTRL_SEQIEN_SEQIEN4_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN4_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN4_DEFAULT << 4)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN5                     (0x1UL << 5)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN5_SHIFT              5                                       /**< Shift value for SMCTRL_SEQIEN5              */
#define _SMCTRL_SEQIEN_SEQIEN5_MASK               0x20UL                                  /**< Bit mask for SMCTRL_SEQIEN5                 */
#define _SMCTRL_SEQIEN_SEQIEN5_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN5_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN5_DEFAULT << 5)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN6                     (0x1UL << 6)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN6_SHIFT              6                                       /**< Shift value for SMCTRL_SEQIEN6              */
#define _SMCTRL_SEQIEN_SEQIEN6_MASK               0x40UL                                  /**< Bit mask for SMCTRL_SEQIEN6                 */
#define _SMCTRL_SEQIEN_SEQIEN6_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN6_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN6_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN7                     (0x1UL << 7)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN7_SHIFT              7                                       /**< Shift value for SMCTRL_SEQIEN7              */
#define _SMCTRL_SEQIEN_SEQIEN7_MASK               0x80UL                                  /**< Bit mask for SMCTRL_SEQIEN7                 */
#define _SMCTRL_SEQIEN_SEQIEN7_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN7_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN7_DEFAULT << 7)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN8                     (0x1UL << 8)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN8_SHIFT              8                                       /**< Shift value for SMCTRL_SEQIEN8              */
#define _SMCTRL_SEQIEN_SEQIEN8_MASK               0x100UL                                 /**< Bit mask for SMCTRL_SEQIEN8                 */
#define _SMCTRL_SEQIEN_SEQIEN8_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN8_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN8_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN9                     (0x1UL << 9)                            /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN9_SHIFT              9                                       /**< Shift value for SMCTRL_SEQIEN9              */
#define _SMCTRL_SEQIEN_SEQIEN9_MASK               0x200UL                                 /**< Bit mask for SMCTRL_SEQIEN9                 */
#define _SMCTRL_SEQIEN_SEQIEN9_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN9_DEFAULT             (_SMCTRL_SEQIEN_SEQIEN9_DEFAULT << 9)   /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN10                    (0x1UL << 10)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN10_SHIFT             10                                      /**< Shift value for SMCTRL_SEQIEN10             */
#define _SMCTRL_SEQIEN_SEQIEN10_MASK              0x400UL                                 /**< Bit mask for SMCTRL_SEQIEN10                */
#define _SMCTRL_SEQIEN_SEQIEN10_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN10_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN10_DEFAULT << 10) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN11                    (0x1UL << 11)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN11_SHIFT             11                                      /**< Shift value for SMCTRL_SEQIEN11             */
#define _SMCTRL_SEQIEN_SEQIEN11_MASK              0x800UL                                 /**< Bit mask for SMCTRL_SEQIEN11                */
#define _SMCTRL_SEQIEN_SEQIEN11_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN11_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN11_DEFAULT << 11) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN12                    (0x1UL << 12)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN12_SHIFT             12                                      /**< Shift value for SMCTRL_SEQIEN12             */
#define _SMCTRL_SEQIEN_SEQIEN12_MASK              0x1000UL                                /**< Bit mask for SMCTRL_SEQIEN12                */
#define _SMCTRL_SEQIEN_SEQIEN12_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN12_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN12_DEFAULT << 12) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN13                    (0x1UL << 13)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN13_SHIFT             13                                      /**< Shift value for SMCTRL_SEQIEN13             */
#define _SMCTRL_SEQIEN_SEQIEN13_MASK              0x2000UL                                /**< Bit mask for SMCTRL_SEQIEN13                */
#define _SMCTRL_SEQIEN_SEQIEN13_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN13_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN13_DEFAULT << 13) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN14                    (0x1UL << 14)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN14_SHIFT             14                                      /**< Shift value for SMCTRL_SEQIEN14             */
#define _SMCTRL_SEQIEN_SEQIEN14_MASK              0x4000UL                                /**< Bit mask for SMCTRL_SEQIEN14                */
#define _SMCTRL_SEQIEN_SEQIEN14_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN14_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN14_DEFAULT << 14) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN15                    (0x1UL << 15)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN15_SHIFT             15                                      /**< Shift value for SMCTRL_SEQIEN15             */
#define _SMCTRL_SEQIEN_SEQIEN15_MASK              0x8000UL                                /**< Bit mask for SMCTRL_SEQIEN15                */
#define _SMCTRL_SEQIEN_SEQIEN15_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN15_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN15_DEFAULT << 15) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN16                    (0x1UL << 16)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN16_SHIFT             16                                      /**< Shift value for SMCTRL_SEQIEN16             */
#define _SMCTRL_SEQIEN_SEQIEN16_MASK              0x10000UL                               /**< Bit mask for SMCTRL_SEQIEN16                */
#define _SMCTRL_SEQIEN_SEQIEN16_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN16_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN16_DEFAULT << 16) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN17                    (0x1UL << 17)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN17_SHIFT             17                                      /**< Shift value for SMCTRL_SEQIEN17             */
#define _SMCTRL_SEQIEN_SEQIEN17_MASK              0x20000UL                               /**< Bit mask for SMCTRL_SEQIEN17                */
#define _SMCTRL_SEQIEN_SEQIEN17_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN17_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN17_DEFAULT << 17) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN18                    (0x1UL << 18)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN18_SHIFT             18                                      /**< Shift value for SMCTRL_SEQIEN18             */
#define _SMCTRL_SEQIEN_SEQIEN18_MASK              0x40000UL                               /**< Bit mask for SMCTRL_SEQIEN18                */
#define _SMCTRL_SEQIEN_SEQIEN18_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN18_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN18_DEFAULT << 18) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN19                    (0x1UL << 19)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN19_SHIFT             19                                      /**< Shift value for SMCTRL_SEQIEN19             */
#define _SMCTRL_SEQIEN_SEQIEN19_MASK              0x80000UL                               /**< Bit mask for SMCTRL_SEQIEN19                */
#define _SMCTRL_SEQIEN_SEQIEN19_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN19_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN19_DEFAULT << 19) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN20                    (0x1UL << 20)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN20_SHIFT             20                                      /**< Shift value for SMCTRL_SEQIEN20             */
#define _SMCTRL_SEQIEN_SEQIEN20_MASK              0x100000UL                              /**< Bit mask for SMCTRL_SEQIEN20                */
#define _SMCTRL_SEQIEN_SEQIEN20_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN20_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN20_DEFAULT << 20) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN21                    (0x1UL << 21)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN21_SHIFT             21                                      /**< Shift value for SMCTRL_SEQIEN21             */
#define _SMCTRL_SEQIEN_SEQIEN21_MASK              0x200000UL                              /**< Bit mask for SMCTRL_SEQIEN21                */
#define _SMCTRL_SEQIEN_SEQIEN21_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN21_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN21_DEFAULT << 21) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN22                    (0x1UL << 22)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN22_SHIFT             22                                      /**< Shift value for SMCTRL_SEQIEN22             */
#define _SMCTRL_SEQIEN_SEQIEN22_MASK              0x400000UL                              /**< Bit mask for SMCTRL_SEQIEN22                */
#define _SMCTRL_SEQIEN_SEQIEN22_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN22_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN22_DEFAULT << 22) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN23                    (0x1UL << 23)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN23_SHIFT             23                                      /**< Shift value for SMCTRL_SEQIEN23             */
#define _SMCTRL_SEQIEN_SEQIEN23_MASK              0x800000UL                              /**< Bit mask for SMCTRL_SEQIEN23                */
#define _SMCTRL_SEQIEN_SEQIEN23_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN23_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN23_DEFAULT << 23) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN24                    (0x1UL << 24)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN24_SHIFT             24                                      /**< Shift value for SMCTRL_SEQIEN24             */
#define _SMCTRL_SEQIEN_SEQIEN24_MASK              0x1000000UL                             /**< Bit mask for SMCTRL_SEQIEN24                */
#define _SMCTRL_SEQIEN_SEQIEN24_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN24_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN24_DEFAULT << 24) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN25                    (0x1UL << 25)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN25_SHIFT             25                                      /**< Shift value for SMCTRL_SEQIEN25             */
#define _SMCTRL_SEQIEN_SEQIEN25_MASK              0x2000000UL                             /**< Bit mask for SMCTRL_SEQIEN25                */
#define _SMCTRL_SEQIEN_SEQIEN25_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN25_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN25_DEFAULT << 25) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN26                    (0x1UL << 26)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN26_SHIFT             26                                      /**< Shift value for SMCTRL_SEQIEN26             */
#define _SMCTRL_SEQIEN_SEQIEN26_MASK              0x4000000UL                             /**< Bit mask for SMCTRL_SEQIEN26                */
#define _SMCTRL_SEQIEN_SEQIEN26_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN26_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN26_DEFAULT << 26) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN27                    (0x1UL << 27)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN27_SHIFT             27                                      /**< Shift value for SMCTRL_SEQIEN27             */
#define _SMCTRL_SEQIEN_SEQIEN27_MASK              0x8000000UL                             /**< Bit mask for SMCTRL_SEQIEN27                */
#define _SMCTRL_SEQIEN_SEQIEN27_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN27_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN27_DEFAULT << 27) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN28                    (0x1UL << 28)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN28_SHIFT             28                                      /**< Shift value for SMCTRL_SEQIEN28             */
#define _SMCTRL_SEQIEN_SEQIEN28_MASK              0x10000000UL                            /**< Bit mask for SMCTRL_SEQIEN28                */
#define _SMCTRL_SEQIEN_SEQIEN28_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN28_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN28_DEFAULT << 28) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN29                    (0x1UL << 29)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN29_SHIFT             29                                      /**< Shift value for SMCTRL_SEQIEN29             */
#define _SMCTRL_SEQIEN_SEQIEN29_MASK              0x20000000UL                            /**< Bit mask for SMCTRL_SEQIEN29                */
#define _SMCTRL_SEQIEN_SEQIEN29_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
