SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
#define SMCTRL_SEQIEN_SEQIEN29_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN29_DEFAULT << 29) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN30                    (0x1UL << 30)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN30_SHIFT             30                                      /**< Shift value for SMCTRL_SEQIEN30             */
#define _SMCTRL_SEQIEN_SEQIEN30_MASK              0x40000000UL                            /**< Bit mask for SMCTRL_SEQIEN30                */
#define _SMCTRL_SEQIEN_SEQIEN30_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN30_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN30_DEFAULT << 30) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */
#define SMCTRL_SEQIEN_SEQIEN31                    (0x1UL << 31)                           /**< Sequencer Interrupt Enable                  */
#define _SMCTRL_SEQIEN_SEQIEN31_SHIFT             31                                      /**< Shift value for SMCTRL_SEQIEN31             */
#define _SMCTRL_SEQIEN_SEQIEN31_MASK              0x80000000UL                            /**< Bit mask for SMCTRL_SEQIEN31                */
#define _SMCTRL_SEQIEN_SEQIEN31_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SEQIEN              */
#define SMCTRL_SEQIEN_SEQIEN31_DEFAULT            (_SMCTRL_SEQIEN_SEQIEN31_DEFAULT << 31) /**< Shifted mode DEFAULT for SMCTRL_SEQIEN      */

/* Bit fields for SMCTRL SWIF */
#define _SMCTRL_SWIF_RESETVALUE                   0x00000000UL                          /**< Default value for SMCTRL_SWIF               */
#define _SMCTRL_SWIF_MASK                         0x000000FFUL                          /**< Mask for SMCTRL_SWIF                        */
#define SMCTRL_SWIF_SWIF0                         (0x1UL << 0)                          /**< Local SW Interupt Flag                      */
#define _SMCTRL_SWIF_SWIF0_SHIFT                  0                                     /**< Shift value for SMCTRL_SWIF0                */
#define _SMCTRL_SWIF_SWIF0_MASK                   0x1UL                                 /**< Bit mask for SMCTRL_SWIF0                   */
#define _SMCTRL_SWIF_SWIF0_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIF                */
#define SMCTRL_SWIF_SWIF0_DEFAULT                 (_SMCTRL_SWIF_SWIF0_DEFAULT << 0)     /**< Shifted mode DEFAULT for SMCTRL_SWIF        */
#define SMCTRL_SWIF_SWIF1                         (0x1UL << 1)                          /**< Local SW Interupt Flag                      */
#define _SMCTRL_SWIF_SWIF1_SHIFT                  1                                     /**< Shift value for SMCTRL_SWIF1                */
#define _SMCTRL_SWIF_SWIF1_MASK                   0x2UL                                 /**< Bit mask for SMCTRL_SWIF1                   */
#define _SMCTRL_SWIF_SWIF1_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIF                */
#define SMCTRL_SWIF_SWIF1_DEFAULT                 (_SMCTRL_SWIF_SWIF1_DEFAULT << 1)     /**< Shifted mode DEFAULT for SMCTRL_SWIF        */
#define SMCTRL_SWIF_SWIF2                         (0x1UL << 2)                          /**< Local SW Interupt Flag                      */
#define _SMCTRL_SWIF_SWIF2_SHIFT                  2                                     /**< Shift value for SMCTRL_SWIF2                */
#define _SMCTRL_SWIF_SWIF2_MASK                   0x4UL                                 /**< Bit mask for SMCTRL_SWIF2                   */
#define _SMCTRL_SWIF_SWIF2_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIF                */
#define SMCTRL_SWIF_SWIF2_DEFAULT                 (_SMCTRL_SWIF_SWIF2_DEFAULT << 2)     /**< Shifted mode DEFAULT for SMCTRL_SWIF        */
#define SMCTRL_SWIF_SWIF3                         (0x1UL << 3)                          /**< Local SW Interupt Flag                      */
#define _SMCTRL_SWIF_SWIF3_SHIFT                  3                                     /**< Shift value for SMCTRL_SWIF3                */
#define _SMCTRL_SWIF_SWIF3_MASK                   0x8UL                                 /**< Bit mask for SMCTRL_SWIF3                   */
#define _SMCTRL_SWIF_SWIF3_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIF                */
#define SMCTRL_SWIF_SWIF3_DEFAULT                 (_SMCTRL_SWIF_SWIF3_DEFAULT << 3)     /**< Shifted mode DEFAULT for SMCTRL_SWIF        */
#define SMCTRL_SWIF_SWIF4                         (0x1UL << 4)                          /**< Local SW Interupt Flag                      */
#define _SMCTRL_SWIF_SWIF4_SHIFT                  4                                     /**< Shift value for SMCTRL_SWIF4                */
#define _SMCTRL_SWIF_SWIF4_MASK                   0x10UL                                /**< Bit mask for SMCTRL_SWIF4                   */
#define _SMCTRL_SWIF_SWIF4_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIF                */
#define SMCTRL_SWIF_SWIF4_DEFAULT                 (_SMCTRL_SWIF_SWIF4_DEFAULT << 4)     /**< Shifted mode DEFAULT for SMCTRL_SWIF        */
#define SMCTRL_SWIF_SWIF5                         (0x1UL << 5)                          /**< Local SW Interupt Flag                      */
#define _SMCTRL_SWIF_SWIF5_SHIFT                  5                                     /**< Shift value for SMCTRL_SWIF5                */
#define _SMCTRL_SWIF_SWIF5_MASK                   0x20UL                                /**< Bit mask for SMCTRL_SWIF5                   */
#define _SMCTRL_SWIF_SWIF5_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIF                */
#define SMCTRL_SWIF_SWIF5_DEFAULT                 (_SMCTRL_SWIF_SWIF5_DEFAULT << 5)     /**< Shifted mode DEFAULT for SMCTRL_SWIF        */
#define SMCTRL_SWIF_SWIF6                         (0x1UL << 6)                          /**< Local SW Interupt Flag                      */
#define _SMCTRL_SWIF_SWIF6_SHIFT                  6                                     /**< Shift value for SMCTRL_SWIF6                */
#define _SMCTRL_SWIF_SWIF6_MASK                   0x40UL                                /**< Bit mask for SMCTRL_SWIF6                   */
#define _SMCTRL_SWIF_SWIF6_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIF                */
#define SMCTRL_SWIF_SWIF6_DEFAULT                 (_SMCTRL_SWIF_SWIF6_DEFAULT << 6)     /**< Shifted mode DEFAULT for SMCTRL_SWIF        */
#define SMCTRL_SWIF_SWIF7                         (0x1UL << 7)                          /**< Local SW Interupt Flag                      */
#define _SMCTRL_SWIF_SWIF7_SHIFT                  7                                     /**< Shift value for SMCTRL_SWIF7                */
#define _SMCTRL_SWIF_SWIF7_MASK                   0x80UL                                /**< Bit mask for SMCTRL_SWIF7                   */
#define _SMCTRL_SWIF_SWIF7_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIF                */
#define SMCTRL_SWIF_SWIF7_DEFAULT                 (_SMCTRL_SWIF_SWIF7_DEFAULT << 7)     /**< Shifted mode DEFAULT for SMCTRL_SWIF        */

