SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
/* Bit fields for SMCTRL SWIEN */
#define _SMCTRL_SWIEN_RESETVALUE                  0x00000000UL                          /**< Default value for SMCTRL_SWIEN              */
#define _SMCTRL_SWIEN_MASK                        0x000000FFUL                          /**< Mask for SMCTRL_SWIEN                       */
#define SMCTRL_SWIEN_SWIEN0                       (0x1UL << 0)                          /**< Local SW Interrupt Enable                   */
#define _SMCTRL_SWIEN_SWIEN0_SHIFT                0                                     /**< Shift value for SMCTRL_SWIEN0               */
#define _SMCTRL_SWIEN_SWIEN0_MASK                 0x1UL                                 /**< Bit mask for SMCTRL_SWIEN0                  */
#define _SMCTRL_SWIEN_SWIEN0_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIEN               */
#define SMCTRL_SWIEN_SWIEN0_DEFAULT               (_SMCTRL_SWIEN_SWIEN0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_SWIEN       */
#define SMCTRL_SWIEN_SWIEN1                       (0x1UL << 1)                          /**< Local SW Interrupt Enable                   */
#define _SMCTRL_SWIEN_SWIEN1_SHIFT                1                                     /**< Shift value for SMCTRL_SWIEN1               */
#define _SMCTRL_SWIEN_SWIEN1_MASK                 0x2UL                                 /**< Bit mask for SMCTRL_SWIEN1                  */
#define _SMCTRL_SWIEN_SWIEN1_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIEN               */
#define SMCTRL_SWIEN_SWIEN1_DEFAULT               (_SMCTRL_SWIEN_SWIEN1_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMCTRL_SWIEN       */
#define SMCTRL_SWIEN_SWIEN2                       (0x1UL << 2)                          /**< Local SW Interrupt Enable                   */
#define _SMCTRL_SWIEN_SWIEN2_SHIFT                2                                     /**< Shift value for SMCTRL_SWIEN2               */
#define _SMCTRL_SWIEN_SWIEN2_MASK                 0x4UL                                 /**< Bit mask for SMCTRL_SWIEN2                  */
#define _SMCTRL_SWIEN_SWIEN2_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIEN               */
#define SMCTRL_SWIEN_SWIEN2_DEFAULT               (_SMCTRL_SWIEN_SWIEN2_DEFAULT << 2)   /**< Shifted mode DEFAULT for SMCTRL_SWIEN       */
#define SMCTRL_SWIEN_SWIEN3                       (0x1UL << 3)                          /**< Local SW Interrupt Enable                   */
#define _SMCTRL_SWIEN_SWIEN3_SHIFT                3                                     /**< Shift value for SMCTRL_SWIEN3               */
#define _SMCTRL_SWIEN_SWIEN3_MASK                 0x8UL                                 /**< Bit mask for SMCTRL_SWIEN3                  */
#define _SMCTRL_SWIEN_SWIEN3_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIEN               */
#define SMCTRL_SWIEN_SWIEN3_DEFAULT               (_SMCTRL_SWIEN_SWIEN3_DEFAULT << 3)   /**< Shifted mode DEFAULT for SMCTRL_SWIEN       */
#define SMCTRL_SWIEN_SWIEN4                       (0x1UL << 4)                          /**< Local SW Interrupt Enable                   */
#define _SMCTRL_SWIEN_SWIEN4_SHIFT                4                                     /**< Shift value for SMCTRL_SWIEN4               */
#define _SMCTRL_SWIEN_SWIEN4_MASK                 0x10UL                                /**< Bit mask for SMCTRL_SWIEN4                  */
#define _SMCTRL_SWIEN_SWIEN4_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIEN               */
#define SMCTRL_SWIEN_SWIEN4_DEFAULT               (_SMCTRL_SWIEN_SWIEN4_DEFAULT << 4)   /**< Shifted mode DEFAULT for SMCTRL_SWIEN       */
#define SMCTRL_SWIEN_SWIEN5                       (0x1UL << 5)                          /**< Local SW Interrupt Enable                   */
#define _SMCTRL_SWIEN_SWIEN5_SHIFT                5                                     /**< Shift value for SMCTRL_SWIEN5               */
#define _SMCTRL_SWIEN_SWIEN5_MASK                 0x20UL                                /**< Bit mask for SMCTRL_SWIEN5                  */
#define _SMCTRL_SWIEN_SWIEN5_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIEN               */
#define SMCTRL_SWIEN_SWIEN5_DEFAULT               (_SMCTRL_SWIEN_SWIEN5_DEFAULT << 5)   /**< Shifted mode DEFAULT for SMCTRL_SWIEN       */
#define SMCTRL_SWIEN_SWIEN6                       (0x1UL << 6)                          /**< Local SW Interrupt Enable                   */
#define _SMCTRL_SWIEN_SWIEN6_SHIFT                6                                     /**< Shift value for SMCTRL_SWIEN6               */
#define _SMCTRL_SWIEN_SWIEN6_MASK                 0x40UL                                /**< Bit mask for SMCTRL_SWIEN6                  */
#define _SMCTRL_SWIEN_SWIEN6_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIEN               */
#define SMCTRL_SWIEN_SWIEN6_DEFAULT               (_SMCTRL_SWIEN_SWIEN6_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMCTRL_SWIEN       */
#define SMCTRL_SWIEN_SWIEN7                       (0x1UL << 7)                          /**< Local SW Interrupt Enable                   */
#define _SMCTRL_SWIEN_SWIEN7_SHIFT                7                                     /**< Shift value for SMCTRL_SWIEN7               */
#define _SMCTRL_SWIEN_SWIEN7_MASK                 0x80UL                                /**< Bit mask for SMCTRL_SWIEN7                  */
#define _SMCTRL_SWIEN_SWIEN7_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_SWIEN               */
#define SMCTRL_SWIEN_SWIEN7_DEFAULT               (_SMCTRL_SWIEN_SWIEN7_DEFAULT << 7)   /**< Shifted mode DEFAULT for SMCTRL_SWIEN       */

/* Bit fields for SMCTRL GPREG */
#define _SMCTRL_GPREG_RESETVALUE                  0x00000000UL                          /**< Default value for SMCTRL_GPREG              */
#define _SMCTRL_GPREG_MASK                        0x0000FFFFUL                          /**< Mask for SMCTRL_GPREG                       */
#define SMCTRL_GPREG_GPREG0                       (0x1UL << 0)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG0_SHIFT                0                                     /**< Shift value for SMCTRL_GPREG0               */
#define _SMCTRL_GPREG_GPREG0_MASK                 0x1UL                                 /**< Bit mask for SMCTRL_GPREG0                  */
#define _SMCTRL_GPREG_GPREG0_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG0_DEFAULT               (_SMCTRL_GPREG_GPREG0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG1                       (0x1UL << 1)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG1_SHIFT                1                                     /**< Shift value for SMCTRL_GPREG1               */
#define _SMCTRL_GPREG_GPREG1_MASK                 0x2UL                                 /**< Bit mask for SMCTRL_GPREG1                  */
#define _SMCTRL_GPREG_GPREG1_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG1_DEFAULT               (_SMCTRL_GPREG_GPREG1_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG2                       (0x1UL << 2)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG2_SHIFT                2                                     /**< Shift value for SMCTRL_GPREG2               */
#define _SMCTRL_GPREG_GPREG2_MASK                 0x4UL                                 /**< Bit mask for SMCTRL_GPREG2                  */
#define _SMCTRL_GPREG_GPREG2_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG2_DEFAULT               (_SMCTRL_GPREG_GPREG2_DEFAULT << 2)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG3                       (0x1UL << 3)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG3_SHIFT                3                                     /**< Shift value for SMCTRL_GPREG3               */
#define _SMCTRL_GPREG_GPREG3_MASK                 0x8UL                                 /**< Bit mask for SMCTRL_GPREG3                  */
#define _SMCTRL_GPREG_GPREG3_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG3_DEFAULT               (_SMCTRL_GPREG_GPREG3_DEFAULT << 3)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG4                       (0x1UL << 4)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG4_SHIFT                4                                     /**< Shift value for SMCTRL_GPREG4               */
#define _SMCTRL_GPREG_GPREG4_MASK                 0x10UL                                /**< Bit mask for SMCTRL_GPREG4                  */
#define _SMCTRL_GPREG_GPREG4_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG4_DEFAULT               (_SMCTRL_GPREG_GPREG4_DEFAULT << 4)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG5                       (0x1UL << 5)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG5_SHIFT                5                                     /**< Shift value for SMCTRL_GPREG5               */
#define _SMCTRL_GPREG_GPREG5_MASK                 0x20UL                                /**< Bit mask for SMCTRL_GPREG5                  */
#define _SMCTRL_GPREG_GPREG5_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG5_DEFAULT               (_SMCTRL_GPREG_GPREG5_DEFAULT << 5)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG6                       (0x1UL << 6)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG6_SHIFT                6                                     /**< Shift value for SMCTRL_GPREG6               */
#define _SMCTRL_GPREG_GPREG6_MASK                 0x40UL                                /**< Bit mask for SMCTRL_GPREG6                  */
#define _SMCTRL_GPREG_GPREG6_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG6_DEFAULT               (_SMCTRL_GPREG_GPREG6_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG7                       (0x1UL << 7)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG7_SHIFT                7                                     /**< Shift value for SMCTRL_GPREG7               */
#define _SMCTRL_GPREG_GPREG7_MASK                 0x80UL                                /**< Bit mask for SMCTRL_GPREG7                  */
#define _SMCTRL_GPREG_GPREG7_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG7_DEFAULT               (_SMCTRL_GPREG_GPREG7_DEFAULT << 7)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG8                       (0x1UL << 8)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG8_SHIFT                8                                     /**< Shift value for SMCTRL_GPREG8               */
#define _SMCTRL_GPREG_GPREG8_MASK                 0x100UL                               /**< Bit mask for SMCTRL_GPREG8                  */
#define _SMCTRL_GPREG_GPREG8_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG8_DEFAULT               (_SMCTRL_GPREG_GPREG8_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG9                       (0x1UL << 9)                          /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG9_SHIFT                9                                     /**< Shift value for SMCTRL_GPREG9               */
#define _SMCTRL_GPREG_GPREG9_MASK                 0x200UL                               /**< Bit mask for SMCTRL_GPREG9                  */
#define _SMCTRL_GPREG_GPREG9_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG9_DEFAULT               (_SMCTRL_GPREG_GPREG9_DEFAULT << 9)   /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG10                      (0x1UL << 10)                         /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG10_SHIFT               10                                    /**< Shift value for SMCTRL_GPREG10              */
#define _SMCTRL_GPREG_GPREG10_MASK                0x400UL                               /**< Bit mask for SMCTRL_GPREG10                 */
#define _SMCTRL_GPREG_GPREG10_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG10_DEFAULT              (_SMCTRL_GPREG_GPREG10_DEFAULT << 10) /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG11                      (0x1UL << 11)                         /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG11_SHIFT               11                                    /**< Shift value for SMCTRL_GPREG11              */
#define _SMCTRL_GPREG_GPREG11_MASK                0x800UL                               /**< Bit mask for SMCTRL_GPREG11                 */
#define _SMCTRL_GPREG_GPREG11_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG11_DEFAULT              (_SMCTRL_GPREG_GPREG11_DEFAULT << 11) /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG12                      (0x1UL << 12)                         /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG12_SHIFT               12                                    /**< Shift value for SMCTRL_GPREG12              */
#define _SMCTRL_GPREG_GPREG12_MASK                0x1000UL                              /**< Bit mask for SMCTRL_GPREG12                 */
#define _SMCTRL_GPREG_GPREG12_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG12_DEFAULT              (_SMCTRL_GPREG_GPREG12_DEFAULT << 12) /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG13                      (0x1UL << 13)                         /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG13_SHIFT               13                                    /**< Shift value for SMCTRL_GPREG13              */
#define _SMCTRL_GPREG_GPREG13_MASK                0x2000UL                              /**< Bit mask for SMCTRL_GPREG13                 */
#define _SMCTRL_GPREG_GPREG13_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG13_DEFAULT              (_SMCTRL_GPREG_GPREG13_DEFAULT << 13) /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG14                      (0x1UL << 14)                         /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG14_SHIFT               14                                    /**< Shift value for SMCTRL_GPREG14              */
#define _SMCTRL_GPREG_GPREG14_MASK                0x4000UL                              /**< Bit mask for SMCTRL_GPREG14                 */
#define _SMCTRL_GPREG_GPREG14_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG14_DEFAULT              (_SMCTRL_GPREG_GPREG14_DEFAULT << 14) /**< Shifted mode DEFAULT for SMCTRL_GPREG       */
#define SMCTRL_GPREG_GPREG15                      (0x1UL << 15)                         /**< General Purpose                             */
#define _SMCTRL_GPREG_GPREG15_SHIFT               15                                    /**< Shift value for SMCTRL_GPREG15              */
#define _SMCTRL_GPREG_GPREG15_MASK                0x8000UL                              /**< Bit mask for SMCTRL_GPREG15                 */
#define _SMCTRL_GPREG_GPREG15_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_GPREG               */
#define SMCTRL_GPREG_GPREG15_DEFAULT              (_SMCTRL_GPREG_GPREG15_DEFAULT << 15) /**< Shifted mode DEFAULT for SMCTRL_GPREG       */

/* Bit fields for SMCTRL TIMIF */
#define _SMCTRL_TIMIF_RESETVALUE                  0x00000000UL                          /**< Default value for SMCTRL_TIMIF              */
#define _SMCTRL_TIMIF_MASK                        0x00000001UL                          /**< Mask for SMCTRL_TIMIF                       */
#define SMCTRL_TIMIF_TIMIF0                       (0x1UL << 0)                          /**< Timer Interupt Flag                         */
#define _SMCTRL_TIMIF_TIMIF0_SHIFT                0                                     /**< Shift value for SMCTRL_TIMIF0               */
#define _SMCTRL_TIMIF_TIMIF0_MASK                 0x1UL                                 /**< Bit mask for SMCTRL_TIMIF0                  */
#define _SMCTRL_TIMIF_TIMIF0_DEFAULT              0x00000000UL                          /**< Mode DEFAULT for SMCTRL_TIMIF               */
#define SMCTRL_TIMIF_TIMIF0_DEFAULT               (_SMCTRL_TIMIF_TIMIF0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_TIMIF       */

/* Bit fields for SMCTRL TIMIEN */
#define _SMCTRL_TIMIEN_RESETVALUE                 0x00000000UL                          /**< Default value for SMCTRL_TIMIEN             */
#define _SMCTRL_TIMIEN_MASK                       0x00000001UL                          /**< Mask for SMCTRL_TIMIEN                      */
#define SMCTRL_TIMIEN_TIMIEN0                     (0x1UL << 0)                          /**< Timer Interrupt Enable                      */
#define _SMCTRL_TIMIEN_TIMIEN0_SHIFT              0                                     /**< Shift value for SMCTRL_TIMIEN0              */
#define _SMCTRL_TIMIEN_TIMIEN0_MASK               0x1UL                                 /**< Bit mask for SMCTRL_TIMIEN0                 */
#define _SMCTRL_TIMIEN_TIMIEN0_DEFAULT            0x00000000UL                          /**< Mode DEFAULT for SMCTRL_TIMIEN              */
#define SMCTRL_TIMIEN_TIMIEN0_DEFAULT             (_SMCTRL_TIMIEN_TIMIEN0_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_TIMIEN      */

/* Bit fields for SMCTRL FRCRXCTRL */
#define _SMCTRL_FRCRXCTRL_RESETVALUE              0x00000000UL                                  /**< Default value for SMCTRL_FRCRXCTRL          */
#define _SMCTRL_FRCRXCTRL_MASK                    0x00000003UL                                  /**< Mask for SMCTRL_FRCRXCTRL                   */
#define SMCTRL_FRCRXCTRL_FDETFALLEDGE             (0x1UL << 0)                                  /**< New BitField                                */
#define _SMCTRL_FRCRXCTRL_FDETFALLEDGE_SHIFT      0                                             /**< Shift value for SMCTRL_FDETFALLEDGE         */
#define _SMCTRL_FRCRXCTRL_FDETFALLEDGE_MASK       0x1UL                                         /**< Bit mask for SMCTRL_FDETFALLEDGE            */
#define _SMCTRL_FRCRXCTRL_FDETFALLEDGE_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for SMCTRL_FRCRXCTRL           */
#define _SMCTRL_FRCRXCTRL_FDETFALLEDGE_DISABLE    0x00000000UL                                  /**< Mode DISABLE for SMCTRL_FRCRXCTRL           */
#define _SMCTRL_FRCRXCTRL_FDETFALLEDGE_ENABLE     0x00000001UL                                  /**< Mode ENABLE for SMCTRL_FRCRXCTRL            */
#define SMCTRL_FRCRXCTRL_FDETFALLEDGE_DEFAULT     (_SMCTRL_FRCRXCTRL_FDETFALLEDGE_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_FRCRXCTRL   */
#define SMCTRL_FRCRXCTRL_FDETFALLEDGE_DISABLE     (_SMCTRL_FRCRXCTRL_FDETFALLEDGE_DISABLE << 0) /**< Shifted mode DISABLE for SMCTRL_FRCRXCTRL   */
#define SMCTRL_FRCRXCTRL_FDETFALLEDGE_ENABLE      (_SMCTRL_FRCRXCTRL_FDETFALLEDGE_ENABLE << 0)  /**< Shifted mode ENABLE for SMCTRL_FRCRXCTRL    */
#define SMCTRL_FRCRXCTRL_FDETCLR                  (0x1UL << 1)                                  /**< New BitField                                */
#define _SMCTRL_FRCRXCTRL_FDETCLR_SHIFT           1                                             /**< Shift value for SMCTRL_FDETCLR              */
#define _SMCTRL_FRCRXCTRL_FDETCLR_MASK            0x2UL                                         /**< Bit mask for SMCTRL_FDETCLR                 */
#define _SMCTRL_FRCRXCTRL_FDETCLR_DEFAULT         0x00000000UL                                  /**< Mode DEFAULT for SMCTRL_FRCRXCTRL           */
#define SMCTRL_FRCRXCTRL_FDETCLR_DEFAULT          (_SMCTRL_FRCRXCTRL_FDETCLR_DEFAULT << 1)      /**< Shifted mode DEFAULT for SMCTRL_FRCRXCTRL   */

