SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
/* Bit fields for SMCTRL CTRL */
#define _SMCTRL_CTRL_RESETVALUE                   0x0003FF00UL                                /**< Default value for SMCTRL_CTRL               */
#define _SMCTRL_CTRL_MASK                         0x0FFFFFFFUL                                /**< Mask for SMCTRL_CTRL                        */
#define SMCTRL_CTRL_FETCHEN                       (0x1UL << 0)                                /**< New BitField                                */
#define _SMCTRL_CTRL_FETCHEN_SHIFT                0                                           /**< Shift value for SMCTRL_FETCHEN              */
#define _SMCTRL_CTRL_FETCHEN_MASK                 0x1UL                                       /**< Bit mask for SMCTRL_FETCHEN                 */
#define _SMCTRL_CTRL_FETCHEN_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_FETCHEN_DEFAULT               (_SMCTRL_CTRL_FETCHEN_DEFAULT << 0)         /**< Shifted mode DEFAULT for SMCTRL_CTRL        */
#define SMCTRL_CTRL_FEFILT0INPUTSEL               (0x1UL << 1)                                /**< New BitField                                */
#define _SMCTRL_CTRL_FEFILT0INPUTSEL_SHIFT        1                                           /**< Shift value for SMCTRL_FEFILT0INPUTSEL      */
#define _SMCTRL_CTRL_FEFILT0INPUTSEL_MASK         0x2UL                                       /**< Bit mask for SMCTRL_FEFILT0INPUTSEL         */
#define _SMCTRL_CTRL_FEFILT0INPUTSEL_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_FEFILT0INPUTSEL_DEFAULT       (_SMCTRL_CTRL_FEFILT0INPUTSEL_DEFAULT << 1) /**< Shifted mode DEFAULT for SMCTRL_CTRL        */
#define SMCTRL_CTRL_IRCAL0SEL                     (0x1UL << 2)                                /**< New BitField                                */
#define _SMCTRL_CTRL_IRCAL0SEL_SHIFT              2                                           /**< Shift value for SMCTRL_IRCAL0SEL            */
#define _SMCTRL_CTRL_IRCAL0SEL_MASK               0x4UL                                       /**< Bit mask for SMCTRL_IRCAL0SEL               */
#define _SMCTRL_CTRL_IRCAL0SEL_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_IRCAL0SEL_DEFAULT             (_SMCTRL_CTRL_IRCAL0SEL_DEFAULT << 2)       /**< Shifted mode DEFAULT for SMCTRL_CTRL        */
#define SMCTRL_CTRL_IRCAL1SEL                     (0x1UL << 3)                                /**< New BitField                                */
#define _SMCTRL_CTRL_IRCAL1SEL_SHIFT              3                                           /**< Shift value for SMCTRL_IRCAL1SEL            */
#define _SMCTRL_CTRL_IRCAL1SEL_MASK               0x8UL                                       /**< Bit mask for SMCTRL_IRCAL1SEL               */
#define _SMCTRL_CTRL_IRCAL1SEL_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_IRCAL1SEL_DEFAULT             (_SMCTRL_CTRL_IRCAL1SEL_DEFAULT << 3)       /**< Shifted mode DEFAULT for SMCTRL_CTRL        */
#define SMCTRL_CTRL_RISCVSSRESETREQ               (0x1UL << 4)                                /**< New BitField                                */
#define _SMCTRL_CTRL_RISCVSSRESETREQ_SHIFT        4                                           /**< Shift value for SMCTRL_RISCVSSRESETREQ      */
#define _SMCTRL_CTRL_RISCVSSRESETREQ_MASK         0x10UL                                      /**< Bit mask for SMCTRL_RISCVSSRESETREQ         */
#define _SMCTRL_CTRL_RISCVSSRESETREQ_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_RISCVSSRESETREQ_DEFAULT       (_SMCTRL_CTRL_RISCVSSRESETREQ_DEFAULT << 4) /**< Shifted mode DEFAULT for SMCTRL_CTRL        */
#define SMCTRL_CTRL_RISCVSSRESETACK               (0x1UL << 5)                                /**< New BitField                                */
#define _SMCTRL_CTRL_RISCVSSRESETACK_SHIFT        5                                           /**< Shift value for SMCTRL_RISCVSSRESETACK      */
#define _SMCTRL_CTRL_RISCVSSRESETACK_MASK         0x20UL                                      /**< Bit mask for SMCTRL_RISCVSSRESETACK         */
#define _SMCTRL_CTRL_RISCVSSRESETACK_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_RISCVSSRESETACK_DEFAULT       (_SMCTRL_CTRL_RISCVSSRESETACK_DEFAULT << 5) /**< Shifted mode DEFAULT for SMCTRL_CTRL        */
#define SMCTRL_CTRL_ECA0INPUTSEL                  (0x1UL << 6)                                /**< New BitField                                */
#define _SMCTRL_CTRL_ECA0INPUTSEL_SHIFT           6                                           /**< Shift value for SMCTRL_ECA0INPUTSEL         */
#define _SMCTRL_CTRL_ECA0INPUTSEL_MASK            0x40UL                                      /**< Bit mask for SMCTRL_ECA0INPUTSEL            */
#define _SMCTRL_CTRL_ECA0INPUTSEL_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_ECA0INPUTSEL_DEFAULT          (_SMCTRL_CTRL_ECA0INPUTSEL_DEFAULT << 6)    /**< Shifted mode DEFAULT for SMCTRL_CTRL        */
#define SMCTRL_CTRL_ECA1INPUTSEL                  (0x1UL << 7)                                /**< New BitField                                */
#define _SMCTRL_CTRL_ECA1INPUTSEL_SHIFT           7                                           /**< Shift value for SMCTRL_ECA1INPUTSEL         */
#define _SMCTRL_CTRL_ECA1INPUTSEL_MASK            0x80UL                                      /**< Bit mask for SMCTRL_ECA1INPUTSEL            */
#define _SMCTRL_CTRL_ECA1INPUTSEL_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_ECA1INPUTSEL_DEFAULT          (_SMCTRL_CTRL_ECA1INPUTSEL_DEFAULT << 7)    /**< Shifted mode DEFAULT for SMCTRL_CTRL        */
#define _SMCTRL_CTRL_RXF1TIMEREN_SHIFT            8                                           /**< Shift value for SMCTRL_RXF1TIMEREN          */
#define _SMCTRL_CTRL_RXF1TIMEREN_MASK             0x3FF00UL                                   /**< Bit mask for SMCTRL_RXF1TIMEREN             */
#define _SMCTRL_CTRL_RXF1TIMEREN_DEFAULT          0x000003FFUL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_RXF1TIMEREN_DEFAULT           (_SMCTRL_CTRL_RXF1TIMEREN_DEFAULT << 8)     /**< Shifted mode DEFAULT for SMCTRL_CTRL        */
#define _SMCTRL_CTRL_RXF2TIMEREN_SHIFT            18                                          /**< Shift value for SMCTRL_RXF2TIMEREN          */
#define _SMCTRL_CTRL_RXF2TIMEREN_MASK             0xFFC0000UL                                 /**< Bit mask for SMCTRL_RXF2TIMEREN             */
#define _SMCTRL_CTRL_RXF2TIMEREN_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for SMCTRL_CTRL                */
#define SMCTRL_CTRL_RXF2TIMEREN_DEFAULT           (_SMCTRL_CTRL_RXF2TIMEREN_DEFAULT << 18)    /**< Shifted mode DEFAULT for SMCTRL_CTRL        */

/* Bit fields for SMCTRL PC */
#define _SMCTRL_PC_RESETVALUE                     0x00000000UL                          /**< Default value for SMCTRL_PC                 */
#define _SMCTRL_PC_MASK                           0xFFFFFFFFUL                          /**< Mask for SMCTRL_PC                          */
#define _SMCTRL_PC_PC_SHIFT                       0                                     /**< Shift value for SMCTRL_PC                   */
#define _SMCTRL_PC_PC_MASK                        0xFFFFFFFFUL                          /**< Bit mask for SMCTRL_PC                      */
#define _SMCTRL_PC_PC_DEFAULT                     0x00000000UL                          /**< Mode DEFAULT for SMCTRL_PC                  */
#define SMCTRL_PC_PC_DEFAULT                      (_SMCTRL_PC_PC_DEFAULT << 0)          /**< Shifted mode DEFAULT for SMCTRL_PC          */

/* Bit fields for SMCTRL SCRATCH0 */
#define _SMCTRL_SCRATCH0_RESETVALUE               0x00000000UL                             /**< Default value for SMCTRL_SCRATCH0           */
#define _SMCTRL_SCRATCH0_MASK                     0xFFFFFFFFUL                             /**< Mask for SMCTRL_SCRATCH0                    */
#define _SMCTRL_SCRATCH0_SCRATCH0_SHIFT           0                                        /**< Shift value for SMCTRL_SCRATCH0             */
#define _SMCTRL_SCRATCH0_SCRATCH0_MASK            0xFFFFFFFFUL                             /**< Bit mask for SMCTRL_SCRATCH0                */
#define _SMCTRL_SCRATCH0_SCRATCH0_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for SMCTRL_SCRATCH0            */
#define SMCTRL_SCRATCH0_SCRATCH0_DEFAULT          (_SMCTRL_SCRATCH0_SCRATCH0_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_SCRATCH0    */

/* Bit fields for SMCTRL SCRATCH1 */
#define _SMCTRL_SCRATCH1_RESETVALUE               0x00000000UL                             /**< Default value for SMCTRL_SCRATCH1           */
#define _SMCTRL_SCRATCH1_MASK                     0xFFFFFFFFUL                             /**< Mask for SMCTRL_SCRATCH1                    */
#define _SMCTRL_SCRATCH1_SCRATCH1_SHIFT           0                                        /**< Shift value for SMCTRL_SCRATCH1             */
#define _SMCTRL_SCRATCH1_SCRATCH1_MASK            0xFFFFFFFFUL                             /**< Bit mask for SMCTRL_SCRATCH1                */
#define _SMCTRL_SCRATCH1_SCRATCH1_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for SMCTRL_SCRATCH1            */
#define SMCTRL_SCRATCH1_SCRATCH1_DEFAULT          (_SMCTRL_SCRATCH1_SCRATCH1_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_SCRATCH1    */

/* Bit fields for SMCTRL SCRATCH2 */
#define _SMCTRL_SCRATCH2_RESETVALUE               0x00000000UL                             /**< Default value for SMCTRL_SCRATCH2           */
#define _SMCTRL_SCRATCH2_MASK                     0xFFFFFFFFUL                             /**< Mask for SMCTRL_SCRATCH2                    */
#define _SMCTRL_SCRATCH2_SCRATCH2_SHIFT           0                                        /**< Shift value for SMCTRL_SCRATCH2             */
#define _SMCTRL_SCRATCH2_SCRATCH2_MASK            0xFFFFFFFFUL                             /**< Bit mask for SMCTRL_SCRATCH2                */
#define _SMCTRL_SCRATCH2_SCRATCH2_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for SMCTRL_SCRATCH2            */
#define SMCTRL_SCRATCH2_SCRATCH2_DEFAULT          (_SMCTRL_SCRATCH2_SCRATCH2_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_SCRATCH2    */

