SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
/* Bit fields for SMCTRL SCRATCH3 */
#define _SMCTRL_SCRATCH3_RESETVALUE               0x00000000UL                             /**< Default value for SMCTRL_SCRATCH3           */
#define _SMCTRL_SCRATCH3_MASK                     0xFFFFFFFFUL                             /**< Mask for SMCTRL_SCRATCH3                    */
#define _SMCTRL_SCRATCH3_SCRATCH3_SHIFT           0                                        /**< Shift value for SMCTRL_SCRATCH3             */
#define _SMCTRL_SCRATCH3_SCRATCH3_MASK            0xFFFFFFFFUL                             /**< Bit mask for SMCTRL_SCRATCH3                */
#define _SMCTRL_SCRATCH3_SCRATCH3_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for SMCTRL_SCRATCH3            */
#define SMCTRL_SCRATCH3_SCRATCH3_DEFAULT          (_SMCTRL_SCRATCH3_SCRATCH3_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_SCRATCH3    */

/* Bit fields for SMCTRL SCRATCH4 */
#define _SMCTRL_SCRATCH4_RESETVALUE               0x00000000UL                             /**< Default value for SMCTRL_SCRATCH4           */
#define _SMCTRL_SCRATCH4_MASK                     0xFFFFFFFFUL                             /**< Mask for SMCTRL_SCRATCH4                    */
#define _SMCTRL_SCRATCH4_SCRATCH4_SHIFT           0                                        /**< Shift value for SMCTRL_SCRATCH4             */
#define _SMCTRL_SCRATCH4_SCRATCH4_MASK            0xFFFFFFFFUL                             /**< Bit mask for SMCTRL_SCRATCH4                */
#define _SMCTRL_SCRATCH4_SCRATCH4_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for SMCTRL_SCRATCH4            */
#define SMCTRL_SCRATCH4_SCRATCH4_DEFAULT          (_SMCTRL_SCRATCH4_SCRATCH4_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_SCRATCH4    */

/* Bit fields for SMCTRL SCRATCH5 */
#define _SMCTRL_SCRATCH5_RESETVALUE               0x00000000UL                             /**< Default value for SMCTRL_SCRATCH5           */
#define _SMCTRL_SCRATCH5_MASK                     0xFFFFFFFFUL                             /**< Mask for SMCTRL_SCRATCH5                    */
#define _SMCTRL_SCRATCH5_SCRATCH5_SHIFT           0                                        /**< Shift value for SMCTRL_SCRATCH5             */
#define _SMCTRL_SCRATCH5_SCRATCH5_MASK            0xFFFFFFFFUL                             /**< Bit mask for SMCTRL_SCRATCH5                */
#define _SMCTRL_SCRATCH5_SCRATCH5_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for SMCTRL_SCRATCH5            */
#define SMCTRL_SCRATCH5_SCRATCH5_DEFAULT          (_SMCTRL_SCRATCH5_SCRATCH5_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_SCRATCH5    */

/* Bit fields for SMCTRL SCRATCH6 */
#define _SMCTRL_SCRATCH6_RESETVALUE               0x00000000UL                             /**< Default value for SMCTRL_SCRATCH6           */
#define _SMCTRL_SCRATCH6_MASK                     0xFFFFFFFFUL                             /**< Mask for SMCTRL_SCRATCH6                    */
#define _SMCTRL_SCRATCH6_SCRATCH6_SHIFT           0                                        /**< Shift value for SMCTRL_SCRATCH6             */
#define _SMCTRL_SCRATCH6_SCRATCH6_MASK            0xFFFFFFFFUL                             /**< Bit mask for SMCTRL_SCRATCH6                */
#define _SMCTRL_SCRATCH6_SCRATCH6_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for SMCTRL_SCRATCH6            */
#define SMCTRL_SCRATCH6_SCRATCH6_DEFAULT          (_SMCTRL_SCRATCH6_SCRATCH6_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_SCRATCH6    */

/* Bit fields for SMCTRL SCRATCH7 */
#define _SMCTRL_SCRATCH7_RESETVALUE               0x00000000UL                             /**< Default value for SMCTRL_SCRATCH7           */
#define _SMCTRL_SCRATCH7_MASK                     0xFFFFFFFFUL                             /**< Mask for SMCTRL_SCRATCH7                    */
#define _SMCTRL_SCRATCH7_SCRATCH7_SHIFT           0                                        /**< Shift value for SMCTRL_SCRATCH7             */
#define _SMCTRL_SCRATCH7_SCRATCH7_MASK            0xFFFFFFFFUL                             /**< Bit mask for SMCTRL_SCRATCH7                */
#define _SMCTRL_SCRATCH7_SCRATCH7_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for SMCTRL_SCRATCH7            */
#define SMCTRL_SCRATCH7_SCRATCH7_DEFAULT          (_SMCTRL_SCRATCH7_SCRATCH7_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_SCRATCH7    */

/* Bit fields for SMCTRL PRSMUXLSB */
#define _SMCTRL_PRSMUXLSB_RESETVALUE              0x00000000UL                                 /**< Default value for SMCTRL_PRSMUXLSB          */
#define _SMCTRL_PRSMUXLSB_MASK                    0x00FFFFFFUL                                 /**< Mask for SMCTRL_PRSMUXLSB                   */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB0_SHIFT        0                                            /**< Shift value for SMCTRL_PRSMUXLSB0           */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB0_MASK         0xFUL                                        /**< Bit mask for SMCTRL_PRSMUXLSB0              */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB0_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXLSB           */
#define SMCTRL_PRSMUXLSB_PRSMUXLSB0_DEFAULT       (_SMCTRL_PRSMUXLSB_PRSMUXLSB0_DEFAULT << 0)  /**< Shifted mode DEFAULT for SMCTRL_PRSMUXLSB   */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB1_SHIFT        4                                            /**< Shift value for SMCTRL_PRSMUXLSB1           */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB1_MASK         0xF0UL                                       /**< Bit mask for SMCTRL_PRSMUXLSB1              */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB1_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXLSB           */
#define SMCTRL_PRSMUXLSB_PRSMUXLSB1_DEFAULT       (_SMCTRL_PRSMUXLSB_PRSMUXLSB1_DEFAULT << 4)  /**< Shifted mode DEFAULT for SMCTRL_PRSMUXLSB   */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB2_SHIFT        8                                            /**< Shift value for SMCTRL_PRSMUXLSB2           */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB2_MASK         0xF00UL                                      /**< Bit mask for SMCTRL_PRSMUXLSB2              */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB2_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXLSB           */
#define SMCTRL_PRSMUXLSB_PRSMUXLSB2_DEFAULT       (_SMCTRL_PRSMUXLSB_PRSMUXLSB2_DEFAULT << 8)  /**< Shifted mode DEFAULT for SMCTRL_PRSMUXLSB   */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB3_SHIFT        12                                           /**< Shift value for SMCTRL_PRSMUXLSB3           */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB3_MASK         0xF000UL                                     /**< Bit mask for SMCTRL_PRSMUXLSB3              */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB3_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXLSB           */
#define SMCTRL_PRSMUXLSB_PRSMUXLSB3_DEFAULT       (_SMCTRL_PRSMUXLSB_PRSMUXLSB3_DEFAULT << 12) /**< Shifted mode DEFAULT for SMCTRL_PRSMUXLSB   */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB4_SHIFT        16                                           /**< Shift value for SMCTRL_PRSMUXLSB4           */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB4_MASK         0xF0000UL                                    /**< Bit mask for SMCTRL_PRSMUXLSB4              */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB4_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXLSB           */
#define SMCTRL_PRSMUXLSB_PRSMUXLSB4_DEFAULT       (_SMCTRL_PRSMUXLSB_PRSMUXLSB4_DEFAULT << 16) /**< Shifted mode DEFAULT for SMCTRL_PRSMUXLSB   */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB5_SHIFT        20                                           /**< Shift value for SMCTRL_PRSMUXLSB5           */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB5_MASK         0xF00000UL                                   /**< Bit mask for SMCTRL_PRSMUXLSB5              */
#define _SMCTRL_PRSMUXLSB_PRSMUXLSB5_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXLSB           */
#define SMCTRL_PRSMUXLSB_PRSMUXLSB5_DEFAULT       (_SMCTRL_PRSMUXLSB_PRSMUXLSB5_DEFAULT << 20) /**< Shifted mode DEFAULT for SMCTRL_PRSMUXLSB   */

/* Bit fields for SMCTRL PRSMUXMSB */
#define _SMCTRL_PRSMUXMSB_RESETVALUE              0x00000000UL                                 /**< Default value for SMCTRL_PRSMUXMSB          */
#define _SMCTRL_PRSMUXMSB_MASK                    0x00FFFFFFUL                                 /**< Mask for SMCTRL_PRSMUXMSB                   */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB0_SHIFT        0                                            /**< Shift value for SMCTRL_PRSMUXMSB0           */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB0_MASK         0xFUL                                        /**< Bit mask for SMCTRL_PRSMUXMSB0              */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB0_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXMSB           */
#define SMCTRL_PRSMUXMSB_PRSMUXMSB0_DEFAULT       (_SMCTRL_PRSMUXMSB_PRSMUXMSB0_DEFAULT << 0)  /**< Shifted mode DEFAULT for SMCTRL_PRSMUXMSB   */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB1_SHIFT        4                                            /**< Shift value for SMCTRL_PRSMUXMSB1           */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB1_MASK         0xF0UL                                       /**< Bit mask for SMCTRL_PRSMUXMSB1              */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB1_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXMSB           */
#define SMCTRL_PRSMUXMSB_PRSMUXMSB1_DEFAULT       (_SMCTRL_PRSMUXMSB_PRSMUXMSB1_DEFAULT << 4)  /**< Shifted mode DEFAULT for SMCTRL_PRSMUXMSB   */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB2_SHIFT        8                                            /**< Shift value for SMCTRL_PRSMUXMSB2           */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB2_MASK         0xF00UL                                      /**< Bit mask for SMCTRL_PRSMUXMSB2              */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB2_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXMSB           */
#define SMCTRL_PRSMUXMSB_PRSMUXMSB2_DEFAULT       (_SMCTRL_PRSMUXMSB_PRSMUXMSB2_DEFAULT << 8)  /**< Shifted mode DEFAULT for SMCTRL_PRSMUXMSB   */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB3_SHIFT        12                                           /**< Shift value for SMCTRL_PRSMUXMSB3           */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB3_MASK         0xF000UL                                     /**< Bit mask for SMCTRL_PRSMUXMSB3              */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB3_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXMSB           */
#define SMCTRL_PRSMUXMSB_PRSMUXMSB3_DEFAULT       (_SMCTRL_PRSMUXMSB_PRSMUXMSB3_DEFAULT << 12) /**< Shifted mode DEFAULT for SMCTRL_PRSMUXMSB   */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB4_SHIFT        16                                           /**< Shift value for SMCTRL_PRSMUXMSB4           */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB4_MASK         0xF0000UL                                    /**< Bit mask for SMCTRL_PRSMUXMSB4              */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB4_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXMSB           */
#define SMCTRL_PRSMUXMSB_PRSMUXMSB4_DEFAULT       (_SMCTRL_PRSMUXMSB_PRSMUXMSB4_DEFAULT << 16) /**< Shifted mode DEFAULT for SMCTRL_PRSMUXMSB   */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB5_SHIFT        20                                           /**< Shift value for SMCTRL_PRSMUXMSB5           */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB5_MASK         0xF00000UL                                   /**< Bit mask for SMCTRL_PRSMUXMSB5              */
#define _SMCTRL_PRSMUXMSB_PRSMUXMSB5_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for SMCTRL_PRSMUXMSB           */
#define SMCTRL_PRSMUXMSB_PRSMUXMSB5_DEFAULT       (_SMCTRL_PRSMUXMSB_PRSMUXMSB5_DEFAULT << 20) /**< Shifted mode DEFAULT for SMCTRL_PRSMUXMSB   */

