SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
/* Bit fields for SMCTRL PRSOUT */
#define _SMCTRL_PRSOUT_RESETVALUE                 0x00000000UL                            /**< Default value for SMCTRL_PRSOUT             */
#define _SMCTRL_PRSOUT_MASK                       0x00FFFFFFUL                            /**< Mask for SMCTRL_PRSOUT                      */
#define _SMCTRL_PRSOUT_PRSOUT0_SHIFT              0                                       /**< Shift value for SMCTRL_PRSOUT0              */
#define _SMCTRL_PRSOUT_PRSOUT0_MASK               0x3UL                                   /**< Bit mask for SMCTRL_PRSOUT0                 */
#define _SMCTRL_PRSOUT_PRSOUT0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT0_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT0_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT0_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT0_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT0_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT0_IDLE                (_SMCTRL_PRSOUT_PRSOUT0_IDLE << 0)      /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT0_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT0_SIGSYNC << 0)   /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT0_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT0_SIGTOG << 0)    /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT0_GPREG               (_SMCTRL_PRSOUT_PRSOUT0_GPREG << 0)     /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT1_SHIFT              2                                       /**< Shift value for SMCTRL_PRSOUT1              */
#define _SMCTRL_PRSOUT_PRSOUT1_MASK               0xCUL                                   /**< Bit mask for SMCTRL_PRSOUT1                 */
#define _SMCTRL_PRSOUT_PRSOUT1_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT1_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT1_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT1_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT1_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT1_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT1_DEFAULT << 2)   /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT1_IDLE                (_SMCTRL_PRSOUT_PRSOUT1_IDLE << 2)      /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT1_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT1_SIGSYNC << 2)   /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT1_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT1_SIGTOG << 2)    /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT1_GPREG               (_SMCTRL_PRSOUT_PRSOUT1_GPREG << 2)     /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT2_SHIFT              4                                       /**< Shift value for SMCTRL_PRSOUT2              */
#define _SMCTRL_PRSOUT_PRSOUT2_MASK               0x30UL                                  /**< Bit mask for SMCTRL_PRSOUT2                 */
#define _SMCTRL_PRSOUT_PRSOUT2_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT2_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT2_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT2_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT2_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT2_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT2_DEFAULT << 4)   /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT2_IDLE                (_SMCTRL_PRSOUT_PRSOUT2_IDLE << 4)      /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT2_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT2_SIGSYNC << 4)   /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT2_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT2_SIGTOG << 4)    /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT2_GPREG               (_SMCTRL_PRSOUT_PRSOUT2_GPREG << 4)     /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT3_SHIFT              6                                       /**< Shift value for SMCTRL_PRSOUT3              */
#define _SMCTRL_PRSOUT_PRSOUT3_MASK               0xC0UL                                  /**< Bit mask for SMCTRL_PRSOUT3                 */
#define _SMCTRL_PRSOUT_PRSOUT3_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT3_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT3_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT3_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT3_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT3_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT3_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT3_IDLE                (_SMCTRL_PRSOUT_PRSOUT3_IDLE << 6)      /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT3_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT3_SIGSYNC << 6)   /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT3_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT3_SIGTOG << 6)    /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT3_GPREG               (_SMCTRL_PRSOUT_PRSOUT3_GPREG << 6)     /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT4_SHIFT              8                                       /**< Shift value for SMCTRL_PRSOUT4              */
#define _SMCTRL_PRSOUT_PRSOUT4_MASK               0x300UL                                 /**< Bit mask for SMCTRL_PRSOUT4                 */
#define _SMCTRL_PRSOUT_PRSOUT4_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT4_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT4_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT4_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT4_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT4_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT4_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT4_IDLE                (_SMCTRL_PRSOUT_PRSOUT4_IDLE << 8)      /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT4_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT4_SIGSYNC << 8)   /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT4_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT4_SIGTOG << 8)    /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT4_GPREG               (_SMCTRL_PRSOUT_PRSOUT4_GPREG << 8)     /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT5_SHIFT              10                                      /**< Shift value for SMCTRL_PRSOUT5              */
#define _SMCTRL_PRSOUT_PRSOUT5_MASK               0xC00UL                                 /**< Bit mask for SMCTRL_PRSOUT5                 */
#define _SMCTRL_PRSOUT_PRSOUT5_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT5_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT5_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT5_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT5_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT5_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT5_DEFAULT << 10)  /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT5_IDLE                (_SMCTRL_PRSOUT_PRSOUT5_IDLE << 10)     /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT5_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT5_SIGSYNC << 10)  /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT5_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT5_SIGTOG << 10)   /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT5_GPREG               (_SMCTRL_PRSOUT_PRSOUT5_GPREG << 10)    /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT6_SHIFT              12                                      /**< Shift value for SMCTRL_PRSOUT6              */
#define _SMCTRL_PRSOUT_PRSOUT6_MASK               0x3000UL                                /**< Bit mask for SMCTRL_PRSOUT6                 */
#define _SMCTRL_PRSOUT_PRSOUT6_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT6_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT6_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT6_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT6_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT6_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT6_DEFAULT << 12)  /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT6_IDLE                (_SMCTRL_PRSOUT_PRSOUT6_IDLE << 12)     /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT6_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT6_SIGSYNC << 12)  /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT6_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT6_SIGTOG << 12)   /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT6_GPREG               (_SMCTRL_PRSOUT_PRSOUT6_GPREG << 12)    /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT7_SHIFT              14                                      /**< Shift value for SMCTRL_PRSOUT7              */
#define _SMCTRL_PRSOUT_PRSOUT7_MASK               0xC000UL                                /**< Bit mask for SMCTRL_PRSOUT7                 */
#define _SMCTRL_PRSOUT_PRSOUT7_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT7_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT7_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT7_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT7_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT7_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT7_DEFAULT << 14)  /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT7_IDLE                (_SMCTRL_PRSOUT_PRSOUT7_IDLE << 14)     /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT7_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT7_SIGSYNC << 14)  /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT7_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT7_SIGTOG << 14)   /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT7_GPREG               (_SMCTRL_PRSOUT_PRSOUT7_GPREG << 14)    /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT8_SHIFT              16                                      /**< Shift value for SMCTRL_PRSOUT8              */
#define _SMCTRL_PRSOUT_PRSOUT8_MASK               0x30000UL                               /**< Bit mask for SMCTRL_PRSOUT8                 */
#define _SMCTRL_PRSOUT_PRSOUT8_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT8_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT8_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT8_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT8_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT8_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT8_DEFAULT << 16)  /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT8_IDLE                (_SMCTRL_PRSOUT_PRSOUT8_IDLE << 16)     /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT8_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT8_SIGSYNC << 16)  /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT8_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT8_SIGTOG << 16)   /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT8_GPREG               (_SMCTRL_PRSOUT_PRSOUT8_GPREG << 16)    /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT9_SHIFT              18                                      /**< Shift value for SMCTRL_PRSOUT9              */
#define _SMCTRL_PRSOUT_PRSOUT9_MASK               0xC0000UL                               /**< Bit mask for SMCTRL_PRSOUT9                 */
#define _SMCTRL_PRSOUT_PRSOUT9_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT9_IDLE               0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT9_SIGSYNC            0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT9_SIGTOG             0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT9_GPREG              0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT9_DEFAULT             (_SMCTRL_PRSOUT_PRSOUT9_DEFAULT << 18)  /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT9_IDLE                (_SMCTRL_PRSOUT_PRSOUT9_IDLE << 18)     /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT9_SIGSYNC             (_SMCTRL_PRSOUT_PRSOUT9_SIGSYNC << 18)  /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT9_SIGTOG              (_SMCTRL_PRSOUT_PRSOUT9_SIGTOG << 18)   /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT9_GPREG               (_SMCTRL_PRSOUT_PRSOUT9_GPREG << 18)    /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT10_SHIFT             20                                      /**< Shift value for SMCTRL_PRSOUT10             */
#define _SMCTRL_PRSOUT_PRSOUT10_MASK              0x300000UL                              /**< Bit mask for SMCTRL_PRSOUT10                */
#define _SMCTRL_PRSOUT_PRSOUT10_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT10_IDLE              0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT10_SIGSYNC           0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT10_SIGTOG            0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT10_GPREG             0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT10_DEFAULT            (_SMCTRL_PRSOUT_PRSOUT10_DEFAULT << 20) /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT10_IDLE               (_SMCTRL_PRSOUT_PRSOUT10_IDLE << 20)    /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT10_SIGSYNC            (_SMCTRL_PRSOUT_PRSOUT10_SIGSYNC << 20) /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT10_SIGTOG             (_SMCTRL_PRSOUT_PRSOUT10_SIGTOG << 20)  /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT10_GPREG              (_SMCTRL_PRSOUT_PRSOUT10_GPREG << 20)   /**< Shifted mode GPREG for SMCTRL_PRSOUT        */
#define _SMCTRL_PRSOUT_PRSOUT11_SHIFT             22                                      /**< Shift value for SMCTRL_PRSOUT11             */
#define _SMCTRL_PRSOUT_PRSOUT11_MASK              0xC00000UL                              /**< Bit mask for SMCTRL_PRSOUT11                */
#define _SMCTRL_PRSOUT_PRSOUT11_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT11_IDLE              0x00000000UL                            /**< Mode IDLE for SMCTRL_PRSOUT                 */
#define _SMCTRL_PRSOUT_PRSOUT11_SIGSYNC           0x00000001UL                            /**< Mode SIGSYNC for SMCTRL_PRSOUT              */
#define _SMCTRL_PRSOUT_PRSOUT11_SIGTOG            0x00000002UL                            /**< Mode SIGTOG for SMCTRL_PRSOUT               */
#define _SMCTRL_PRSOUT_PRSOUT11_GPREG             0x00000003UL                            /**< Mode GPREG for SMCTRL_PRSOUT                */
#define SMCTRL_PRSOUT_PRSOUT11_DEFAULT            (_SMCTRL_PRSOUT_PRSOUT11_DEFAULT << 22) /**< Shifted mode DEFAULT for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT11_IDLE               (_SMCTRL_PRSOUT_PRSOUT11_IDLE << 22)    /**< Shifted mode IDLE for SMCTRL_PRSOUT         */
#define SMCTRL_PRSOUT_PRSOUT11_SIGSYNC            (_SMCTRL_PRSOUT_PRSOUT11_SIGSYNC << 22) /**< Shifted mode SIGSYNC for SMCTRL_PRSOUT      */
#define SMCTRL_PRSOUT_PRSOUT11_SIGTOG             (_SMCTRL_PRSOUT_PRSOUT11_SIGTOG << 22)  /**< Shifted mode SIGTOG for SMCTRL_PRSOUT       */
#define SMCTRL_PRSOUT_PRSOUT11_GPREG              (_SMCTRL_PRSOUT_PRSOUT11_GPREG << 22)   /**< Shifted mode GPREG for SMCTRL_PRSOUT        */

/* Bit fields for SMCTRL RXEVMUX */
#define _SMCTRL_RXEVMUX_RESETVALUE                0x14131211UL                          /**< Default value for SMCTRL_RXEVMUX            */
#define _SMCTRL_RXEVMUX_MASK                      0x1F1F1F1FUL                          /**< Mask for SMCTRL_RXEVMUX                     */
#define _SMCTRL_RXEVMUX_MUX0_SHIFT                0                                     /**< Shift value for SMCTRL_MUX0                 */
#define _SMCTRL_RXEVMUX_MUX0_MASK                 0x1FUL                                /**< Bit mask for SMCTRL_MUX0                    */
#define _SMCTRL_RXEVMUX_MUX0_DEFAULT              0x00000011UL                          /**< Mode DEFAULT for SMCTRL_RXEVMUX             */
#define SMCTRL_RXEVMUX_MUX0_DEFAULT               (_SMCTRL_RXEVMUX_MUX0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_RXEVMUX     */
#define _SMCTRL_RXEVMUX_MUX1_SHIFT                8                                     /**< Shift value for SMCTRL_MUX1                 */
#define _SMCTRL_RXEVMUX_MUX1_MASK                 0x1F00UL                              /**< Bit mask for SMCTRL_MUX1                    */
#define _SMCTRL_RXEVMUX_MUX1_DEFAULT              0x00000012UL                          /**< Mode DEFAULT for SMCTRL_RXEVMUX             */
#define SMCTRL_RXEVMUX_MUX1_DEFAULT               (_SMCTRL_RXEVMUX_MUX1_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMCTRL_RXEVMUX     */
#define _SMCTRL_RXEVMUX_MUX2_SHIFT                16                                    /**< Shift value for SMCTRL_MUX2                 */
#define _SMCTRL_RXEVMUX_MUX2_MASK                 0x1F0000UL                            /**< Bit mask for SMCTRL_MUX2                    */
#define _SMCTRL_RXEVMUX_MUX2_DEFAULT              0x00000013UL                          /**< Mode DEFAULT for SMCTRL_RXEVMUX             */
#define SMCTRL_RXEVMUX_MUX2_DEFAULT               (_SMCTRL_RXEVMUX_MUX2_DEFAULT << 16)  /**< Shifted mode DEFAULT for SMCTRL_RXEVMUX     */
#define _SMCTRL_RXEVMUX_MUX3_SHIFT                24                                    /**< Shift value for SMCTRL_MUX3                 */
#define _SMCTRL_RXEVMUX_MUX3_MASK                 0x1F000000UL                          /**< Bit mask for SMCTRL_MUX3                    */
#define _SMCTRL_RXEVMUX_MUX3_DEFAULT              0x00000014UL                          /**< Mode DEFAULT for SMCTRL_RXEVMUX             */
#define SMCTRL_RXEVMUX_MUX3_DEFAULT               (_SMCTRL_RXEVMUX_MUX3_DEFAULT << 24)  /**< Shifted mode DEFAULT for SMCTRL_RXEVMUX     */

