SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
/* Bit fields for SMCTRL TIMCTRL */
#define _SMCTRL_TIMCTRL_RESETVALUE                0x00000000UL                           /**< Default value for SMCTRL_TIMCTRL            */
#define _SMCTRL_TIMCTRL_MASK                      0x00FFFFFFUL                           /**< Mask for SMCTRL_TIMCTRL                     */
#define SMCTRL_TIMCTRL_INIT0                      (0x1UL << 0)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT0_SHIFT               0                                      /**< Shift value for SMCTRL_INIT0                */
#define _SMCTRL_TIMCTRL_INIT0_MASK                0x1UL                                  /**< Bit mask for SMCTRL_INIT0                   */
#define _SMCTRL_TIMCTRL_INIT0_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT0_DEFAULT              (_SMCTRL_TIMCTRL_INIT0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT1                      (0x1UL << 1)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT1_SHIFT               1                                      /**< Shift value for SMCTRL_INIT1                */
#define _SMCTRL_TIMCTRL_INIT1_MASK                0x2UL                                  /**< Bit mask for SMCTRL_INIT1                   */
#define _SMCTRL_TIMCTRL_INIT1_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT1_DEFAULT              (_SMCTRL_TIMCTRL_INIT1_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT2                      (0x1UL << 2)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT2_SHIFT               2                                      /**< Shift value for SMCTRL_INIT2                */
#define _SMCTRL_TIMCTRL_INIT2_MASK                0x4UL                                  /**< Bit mask for SMCTRL_INIT2                   */
#define _SMCTRL_TIMCTRL_INIT2_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT2_DEFAULT              (_SMCTRL_TIMCTRL_INIT2_DEFAULT << 2)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT3                      (0x1UL << 3)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT3_SHIFT               3                                      /**< Shift value for SMCTRL_INIT3                */
#define _SMCTRL_TIMCTRL_INIT3_MASK                0x8UL                                  /**< Bit mask for SMCTRL_INIT3                   */
#define _SMCTRL_TIMCTRL_INIT3_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT3_DEFAULT              (_SMCTRL_TIMCTRL_INIT3_DEFAULT << 3)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT4                      (0x1UL << 4)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT4_SHIFT               4                                      /**< Shift value for SMCTRL_INIT4                */
#define _SMCTRL_TIMCTRL_INIT4_MASK                0x10UL                                 /**< Bit mask for SMCTRL_INIT4                   */
#define _SMCTRL_TIMCTRL_INIT4_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT4_DEFAULT              (_SMCTRL_TIMCTRL_INIT4_DEFAULT << 4)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT5                      (0x1UL << 5)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT5_SHIFT               5                                      /**< Shift value for SMCTRL_INIT5                */
#define _SMCTRL_TIMCTRL_INIT5_MASK                0x20UL                                 /**< Bit mask for SMCTRL_INIT5                   */
#define _SMCTRL_TIMCTRL_INIT5_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT5_DEFAULT              (_SMCTRL_TIMCTRL_INIT5_DEFAULT << 5)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT6                      (0x1UL << 6)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT6_SHIFT               6                                      /**< Shift value for SMCTRL_INIT6                */
#define _SMCTRL_TIMCTRL_INIT6_MASK                0x40UL                                 /**< Bit mask for SMCTRL_INIT6                   */
#define _SMCTRL_TIMCTRL_INIT6_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT6_DEFAULT              (_SMCTRL_TIMCTRL_INIT6_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT7                      (0x1UL << 7)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT7_SHIFT               7                                      /**< Shift value for SMCTRL_INIT7                */
#define _SMCTRL_TIMCTRL_INIT7_MASK                0x80UL                                 /**< Bit mask for SMCTRL_INIT7                   */
#define _SMCTRL_TIMCTRL_INIT7_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT7_DEFAULT              (_SMCTRL_TIMCTRL_INIT7_DEFAULT << 7)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT8                      (0x1UL << 8)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT8_SHIFT               8                                      /**< Shift value for SMCTRL_INIT8                */
#define _SMCTRL_TIMCTRL_INIT8_MASK                0x100UL                                /**< Bit mask for SMCTRL_INIT8                   */
#define _SMCTRL_TIMCTRL_INIT8_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT8_DEFAULT              (_SMCTRL_TIMCTRL_INIT8_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT9                      (0x1UL << 9)                           /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT9_SHIFT               9                                      /**< Shift value for SMCTRL_INIT9                */
#define _SMCTRL_TIMCTRL_INIT9_MASK                0x200UL                                /**< Bit mask for SMCTRL_INIT9                   */
#define _SMCTRL_TIMCTRL_INIT9_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT9_DEFAULT              (_SMCTRL_TIMCTRL_INIT9_DEFAULT << 9)   /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT10                     (0x1UL << 10)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT10_SHIFT              10                                     /**< Shift value for SMCTRL_INIT10               */
#define _SMCTRL_TIMCTRL_INIT10_MASK               0x400UL                                /**< Bit mask for SMCTRL_INIT10                  */
#define _SMCTRL_TIMCTRL_INIT10_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT10_DEFAULT             (_SMCTRL_TIMCTRL_INIT10_DEFAULT << 10) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT11                     (0x1UL << 11)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT11_SHIFT              11                                     /**< Shift value for SMCTRL_INIT11               */
#define _SMCTRL_TIMCTRL_INIT11_MASK               0x800UL                                /**< Bit mask for SMCTRL_INIT11                  */
#define _SMCTRL_TIMCTRL_INIT11_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT11_DEFAULT             (_SMCTRL_TIMCTRL_INIT11_DEFAULT << 11) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT12                     (0x1UL << 12)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT12_SHIFT              12                                     /**< Shift value for SMCTRL_INIT12               */
#define _SMCTRL_TIMCTRL_INIT12_MASK               0x1000UL                               /**< Bit mask for SMCTRL_INIT12                  */
#define _SMCTRL_TIMCTRL_INIT12_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT12_DEFAULT             (_SMCTRL_TIMCTRL_INIT12_DEFAULT << 12) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT13                     (0x1UL << 13)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT13_SHIFT              13                                     /**< Shift value for SMCTRL_INIT13               */
#define _SMCTRL_TIMCTRL_INIT13_MASK               0x2000UL                               /**< Bit mask for SMCTRL_INIT13                  */
#define _SMCTRL_TIMCTRL_INIT13_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT13_DEFAULT             (_SMCTRL_TIMCTRL_INIT13_DEFAULT << 13) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT14                     (0x1UL << 14)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT14_SHIFT              14                                     /**< Shift value for SMCTRL_INIT14               */
#define _SMCTRL_TIMCTRL_INIT14_MASK               0x4000UL                               /**< Bit mask for SMCTRL_INIT14                  */
#define _SMCTRL_TIMCTRL_INIT14_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT14_DEFAULT             (_SMCTRL_TIMCTRL_INIT14_DEFAULT << 14) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT15                     (0x1UL << 15)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT15_SHIFT              15                                     /**< Shift value for SMCTRL_INIT15               */
#define _SMCTRL_TIMCTRL_INIT15_MASK               0x8000UL                               /**< Bit mask for SMCTRL_INIT15                  */
#define _SMCTRL_TIMCTRL_INIT15_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT15_DEFAULT             (_SMCTRL_TIMCTRL_INIT15_DEFAULT << 15) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT16                     (0x1UL << 16)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT16_SHIFT              16                                     /**< Shift value for SMCTRL_INIT16               */
#define _SMCTRL_TIMCTRL_INIT16_MASK               0x10000UL                              /**< Bit mask for SMCTRL_INIT16                  */
#define _SMCTRL_TIMCTRL_INIT16_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT16_DEFAULT             (_SMCTRL_TIMCTRL_INIT16_DEFAULT << 16) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT17                     (0x1UL << 17)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT17_SHIFT              17                                     /**< Shift value for SMCTRL_INIT17               */
#define _SMCTRL_TIMCTRL_INIT17_MASK               0x20000UL                              /**< Bit mask for SMCTRL_INIT17                  */
#define _SMCTRL_TIMCTRL_INIT17_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT17_DEFAULT             (_SMCTRL_TIMCTRL_INIT17_DEFAULT << 17) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT18                     (0x1UL << 18)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT18_SHIFT              18                                     /**< Shift value for SMCTRL_INIT18               */
#define _SMCTRL_TIMCTRL_INIT18_MASK               0x40000UL                              /**< Bit mask for SMCTRL_INIT18                  */
#define _SMCTRL_TIMCTRL_INIT18_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT18_DEFAULT             (_SMCTRL_TIMCTRL_INIT18_DEFAULT << 18) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT19                     (0x1UL << 19)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT19_SHIFT              19                                     /**< Shift value for SMCTRL_INIT19               */
#define _SMCTRL_TIMCTRL_INIT19_MASK               0x80000UL                              /**< Bit mask for SMCTRL_INIT19                  */
#define _SMCTRL_TIMCTRL_INIT19_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT19_DEFAULT             (_SMCTRL_TIMCTRL_INIT19_DEFAULT << 19) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT20                     (0x1UL << 20)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT20_SHIFT              20                                     /**< Shift value for SMCTRL_INIT20               */
#define _SMCTRL_TIMCTRL_INIT20_MASK               0x100000UL                             /**< Bit mask for SMCTRL_INIT20                  */
#define _SMCTRL_TIMCTRL_INIT20_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT20_DEFAULT             (_SMCTRL_TIMCTRL_INIT20_DEFAULT << 20) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT21                     (0x1UL << 21)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT21_SHIFT              21                                     /**< Shift value for SMCTRL_INIT21               */
#define _SMCTRL_TIMCTRL_INIT21_MASK               0x200000UL                             /**< Bit mask for SMCTRL_INIT21                  */
#define _SMCTRL_TIMCTRL_INIT21_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT21_DEFAULT             (_SMCTRL_TIMCTRL_INIT21_DEFAULT << 21) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT22                     (0x1UL << 22)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT22_SHIFT              22                                     /**< Shift value for SMCTRL_INIT22               */
#define _SMCTRL_TIMCTRL_INIT22_MASK               0x400000UL                             /**< Bit mask for SMCTRL_INIT22                  */
#define _SMCTRL_TIMCTRL_INIT22_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT22_DEFAULT             (_SMCTRL_TIMCTRL_INIT22_DEFAULT << 22) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */
#define SMCTRL_TIMCTRL_INIT23                     (0x1UL << 23)                          /**< New BitField                                */
#define _SMCTRL_TIMCTRL_INIT23_SHIFT              23                                     /**< Shift value for SMCTRL_INIT23               */
#define _SMCTRL_TIMCTRL_INIT23_MASK               0x800000UL                             /**< Bit mask for SMCTRL_INIT23                  */
#define _SMCTRL_TIMCTRL_INIT23_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for SMCTRL_TIMCTRL             */
#define SMCTRL_TIMCTRL_INIT23_DEFAULT             (_SMCTRL_TIMCTRL_INIT23_DEFAULT << 23) /**< Shifted mode DEFAULT for SMCTRL_TIMCTRL     */

