SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
/* Bit fields for SMCTRL TIMSTAT */
#define _SMCTRL_TIMSTAT_RESETVALUE                0x00000000UL                            /**< Default value for SMCTRL_TIMSTAT            */
#define _SMCTRL_TIMSTAT_MASK                      0x00FFFFFFUL                            /**< Mask for SMCTRL_TIMSTAT                     */
#define SMCTRL_TIMSTAT_VALUE0                     (0x1UL << 0)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE0_SHIFT              0                                       /**< Shift value for SMCTRL_VALUE0               */
#define _SMCTRL_TIMSTAT_VALUE0_MASK               0x1UL                                   /**< Bit mask for SMCTRL_VALUE0                  */
#define _SMCTRL_TIMSTAT_VALUE0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE0_DEFAULT             (_SMCTRL_TIMSTAT_VALUE0_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE1                     (0x1UL << 1)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE1_SHIFT              1                                       /**< Shift value for SMCTRL_VALUE1               */
#define _SMCTRL_TIMSTAT_VALUE1_MASK               0x2UL                                   /**< Bit mask for SMCTRL_VALUE1                  */
#define _SMCTRL_TIMSTAT_VALUE1_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE1_DEFAULT             (_SMCTRL_TIMSTAT_VALUE1_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE2                     (0x1UL << 2)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE2_SHIFT              2                                       /**< Shift value for SMCTRL_VALUE2               */
#define _SMCTRL_TIMSTAT_VALUE2_MASK               0x4UL                                   /**< Bit mask for SMCTRL_VALUE2                  */
#define _SMCTRL_TIMSTAT_VALUE2_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE2_DEFAULT             (_SMCTRL_TIMSTAT_VALUE2_DEFAULT << 2)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE3                     (0x1UL << 3)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE3_SHIFT              3                                       /**< Shift value for SMCTRL_VALUE3               */
#define _SMCTRL_TIMSTAT_VALUE3_MASK               0x8UL                                   /**< Bit mask for SMCTRL_VALUE3                  */
#define _SMCTRL_TIMSTAT_VALUE3_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE3_DEFAULT             (_SMCTRL_TIMSTAT_VALUE3_DEFAULT << 3)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE4                     (0x1UL << 4)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE4_SHIFT              4                                       /**< Shift value for SMCTRL_VALUE4               */
#define _SMCTRL_TIMSTAT_VALUE4_MASK               0x10UL                                  /**< Bit mask for SMCTRL_VALUE4                  */
#define _SMCTRL_TIMSTAT_VALUE4_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE4_DEFAULT             (_SMCTRL_TIMSTAT_VALUE4_DEFAULT << 4)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE5                     (0x1UL << 5)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE5_SHIFT              5                                       /**< Shift value for SMCTRL_VALUE5               */
#define _SMCTRL_TIMSTAT_VALUE5_MASK               0x20UL                                  /**< Bit mask for SMCTRL_VALUE5                  */
#define _SMCTRL_TIMSTAT_VALUE5_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE5_DEFAULT             (_SMCTRL_TIMSTAT_VALUE5_DEFAULT << 5)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE6                     (0x1UL << 6)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE6_SHIFT              6                                       /**< Shift value for SMCTRL_VALUE6               */
#define _SMCTRL_TIMSTAT_VALUE6_MASK               0x40UL                                  /**< Bit mask for SMCTRL_VALUE6                  */
#define _SMCTRL_TIMSTAT_VALUE6_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE6_DEFAULT             (_SMCTRL_TIMSTAT_VALUE6_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE7                     (0x1UL << 7)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE7_SHIFT              7                                       /**< Shift value for SMCTRL_VALUE7               */
#define _SMCTRL_TIMSTAT_VALUE7_MASK               0x80UL                                  /**< Bit mask for SMCTRL_VALUE7                  */
#define _SMCTRL_TIMSTAT_VALUE7_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE7_DEFAULT             (_SMCTRL_TIMSTAT_VALUE7_DEFAULT << 7)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE8                     (0x1UL << 8)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE8_SHIFT              8                                       /**< Shift value for SMCTRL_VALUE8               */
#define _SMCTRL_TIMSTAT_VALUE8_MASK               0x100UL                                 /**< Bit mask for SMCTRL_VALUE8                  */
#define _SMCTRL_TIMSTAT_VALUE8_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE8_DEFAULT             (_SMCTRL_TIMSTAT_VALUE8_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE9                     (0x1UL << 9)                            /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE9_SHIFT              9                                       /**< Shift value for SMCTRL_VALUE9               */
#define _SMCTRL_TIMSTAT_VALUE9_MASK               0x200UL                                 /**< Bit mask for SMCTRL_VALUE9                  */
#define _SMCTRL_TIMSTAT_VALUE9_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE9_DEFAULT             (_SMCTRL_TIMSTAT_VALUE9_DEFAULT << 9)   /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE10                    (0x1UL << 10)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE10_SHIFT             10                                      /**< Shift value for SMCTRL_VALUE10              */
#define _SMCTRL_TIMSTAT_VALUE10_MASK              0x400UL                                 /**< Bit mask for SMCTRL_VALUE10                 */
#define _SMCTRL_TIMSTAT_VALUE10_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE10_DEFAULT            (_SMCTRL_TIMSTAT_VALUE10_DEFAULT << 10) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE11                    (0x1UL << 11)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE11_SHIFT             11                                      /**< Shift value for SMCTRL_VALUE11              */
#define _SMCTRL_TIMSTAT_VALUE11_MASK              0x800UL                                 /**< Bit mask for SMCTRL_VALUE11                 */
#define _SMCTRL_TIMSTAT_VALUE11_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE11_DEFAULT            (_SMCTRL_TIMSTAT_VALUE11_DEFAULT << 11) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE12                    (0x1UL << 12)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE12_SHIFT             12                                      /**< Shift value for SMCTRL_VALUE12              */
#define _SMCTRL_TIMSTAT_VALUE12_MASK              0x1000UL                                /**< Bit mask for SMCTRL_VALUE12                 */
#define _SMCTRL_TIMSTAT_VALUE12_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE12_DEFAULT            (_SMCTRL_TIMSTAT_VALUE12_DEFAULT << 12) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE13                    (0x1UL << 13)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE13_SHIFT             13                                      /**< Shift value for SMCTRL_VALUE13              */
#define _SMCTRL_TIMSTAT_VALUE13_MASK              0x2000UL                                /**< Bit mask for SMCTRL_VALUE13                 */
#define _SMCTRL_TIMSTAT_VALUE13_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE13_DEFAULT            (_SMCTRL_TIMSTAT_VALUE13_DEFAULT << 13) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE14                    (0x1UL << 14)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE14_SHIFT             14                                      /**< Shift value for SMCTRL_VALUE14              */
#define _SMCTRL_TIMSTAT_VALUE14_MASK              0x4000UL                                /**< Bit mask for SMCTRL_VALUE14                 */
#define _SMCTRL_TIMSTAT_VALUE14_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE14_DEFAULT            (_SMCTRL_TIMSTAT_VALUE14_DEFAULT << 14) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE15                    (0x1UL << 15)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE15_SHIFT             15                                      /**< Shift value for SMCTRL_VALUE15              */
#define _SMCTRL_TIMSTAT_VALUE15_MASK              0x8000UL                                /**< Bit mask for SMCTRL_VALUE15                 */
#define _SMCTRL_TIMSTAT_VALUE15_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE15_DEFAULT            (_SMCTRL_TIMSTAT_VALUE15_DEFAULT << 15) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE16                    (0x1UL << 16)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE16_SHIFT             16                                      /**< Shift value for SMCTRL_VALUE16              */
#define _SMCTRL_TIMSTAT_VALUE16_MASK              0x10000UL                               /**< Bit mask for SMCTRL_VALUE16                 */
#define _SMCTRL_TIMSTAT_VALUE16_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE16_DEFAULT            (_SMCTRL_TIMSTAT_VALUE16_DEFAULT << 16) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE17                    (0x1UL << 17)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE17_SHIFT             17                                      /**< Shift value for SMCTRL_VALUE17              */
#define _SMCTRL_TIMSTAT_VALUE17_MASK              0x20000UL                               /**< Bit mask for SMCTRL_VALUE17                 */
#define _SMCTRL_TIMSTAT_VALUE17_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE17_DEFAULT            (_SMCTRL_TIMSTAT_VALUE17_DEFAULT << 17) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE18                    (0x1UL << 18)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE18_SHIFT             18                                      /**< Shift value for SMCTRL_VALUE18              */
#define _SMCTRL_TIMSTAT_VALUE18_MASK              0x40000UL                               /**< Bit mask for SMCTRL_VALUE18                 */
#define _SMCTRL_TIMSTAT_VALUE18_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE18_DEFAULT            (_SMCTRL_TIMSTAT_VALUE18_DEFAULT << 18) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE19                    (0x1UL << 19)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE19_SHIFT             19                                      /**< Shift value for SMCTRL_VALUE19              */
#define _SMCTRL_TIMSTAT_VALUE19_MASK              0x80000UL                               /**< Bit mask for SMCTRL_VALUE19                 */
#define _SMCTRL_TIMSTAT_VALUE19_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE19_DEFAULT            (_SMCTRL_TIMSTAT_VALUE19_DEFAULT << 19) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE20                    (0x1UL << 20)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE20_SHIFT             20                                      /**< Shift value for SMCTRL_VALUE20              */
#define _SMCTRL_TIMSTAT_VALUE20_MASK              0x100000UL                              /**< Bit mask for SMCTRL_VALUE20                 */
#define _SMCTRL_TIMSTAT_VALUE20_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE20_DEFAULT            (_SMCTRL_TIMSTAT_VALUE20_DEFAULT << 20) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE21                    (0x1UL << 21)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE21_SHIFT             21                                      /**< Shift value for SMCTRL_VALUE21              */
#define _SMCTRL_TIMSTAT_VALUE21_MASK              0x200000UL                              /**< Bit mask for SMCTRL_VALUE21                 */
#define _SMCTRL_TIMSTAT_VALUE21_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE21_DEFAULT            (_SMCTRL_TIMSTAT_VALUE21_DEFAULT << 21) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE22                    (0x1UL << 22)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE22_SHIFT             22                                      /**< Shift value for SMCTRL_VALUE22              */
#define _SMCTRL_TIMSTAT_VALUE22_MASK              0x400000UL                              /**< Bit mask for SMCTRL_VALUE22                 */
#define _SMCTRL_TIMSTAT_VALUE22_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE22_DEFAULT            (_SMCTRL_TIMSTAT_VALUE22_DEFAULT << 22) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */
#define SMCTRL_TIMSTAT_VALUE23                    (0x1UL << 23)                           /**< New BitField                                */
#define _SMCTRL_TIMSTAT_VALUE23_SHIFT             23                                      /**< Shift value for SMCTRL_VALUE23              */
#define _SMCTRL_TIMSTAT_VALUE23_MASK              0x800000UL                              /**< Bit mask for SMCTRL_VALUE23                 */
#define _SMCTRL_TIMSTAT_VALUE23_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SMCTRL_TIMSTAT             */
#define SMCTRL_TIMSTAT_VALUE23_DEFAULT            (_SMCTRL_TIMSTAT_VALUE23_DEFAULT << 23) /**< Shifted mode DEFAULT for SMCTRL_TIMSTAT     */

/* Bit fields for SMCTRL SHIFTS */
#define _SMCTRL_SHIFTS_RESETVALUE                 0x00000000UL                            /**< Default value for SMCTRL_SHIFTS             */
#define _SMCTRL_SHIFTS_MASK                       0x0000000FUL                            /**< Mask for SMCTRL_SHIFTS                      */
#define _SMCTRL_SHIFTS_SHIFTRXF1_SHIFT            0                                       /**< Shift value for SMCTRL_SHIFTRXF1            */
#define _SMCTRL_SHIFTS_SHIFTRXF1_MASK             0x3UL                                   /**< Bit mask for SMCTRL_SHIFTRXF1               */
#define _SMCTRL_SHIFTS_SHIFTRXF1_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SHIFTS              */
#define SMCTRL_SHIFTS_SHIFTRXF1_DEFAULT           (_SMCTRL_SHIFTS_SHIFTRXF1_DEFAULT << 0) /**< Shifted mode DEFAULT for SMCTRL_SHIFTS      */
#define _SMCTRL_SHIFTS_SHIFTRXF2_SHIFT            2                                       /**< Shift value for SMCTRL_SHIFTRXF2            */
#define _SMCTRL_SHIFTS_SHIFTRXF2_MASK             0xCUL                                   /**< Bit mask for SMCTRL_SHIFTRXF2               */
#define _SMCTRL_SHIFTS_SHIFTRXF2_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for SMCTRL_SHIFTS              */
#define SMCTRL_SHIFTS_SHIFTRXF2_DEFAULT           (_SMCTRL_SHIFTS_SHIFTRXF2_DEFAULT << 2) /**< Shifted mode DEFAULT for SMCTRL_SHIFTS      */

