SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smctrl.h
/* Bit fields for SMCTRL TXDONE */
#define _SMCTRL_TXDONE_RESETVALUE                 0x00000000UL                          /**< Default value for SMCTRL_TXDONE             */
#define _SMCTRL_TXDONE_MASK                       0x00000001UL                          /**< Mask for SMCTRL_TXDONE                      */
#define SMCTRL_TXDONE_TXDONE                      (0x1UL << 0)                          /**< New BitField                                */
#define _SMCTRL_TXDONE_TXDONE_SHIFT               0                                     /**< Shift value for SMCTRL_TXDONE               */
#define _SMCTRL_TXDONE_TXDONE_MASK                0x1UL                                 /**< Bit mask for SMCTRL_TXDONE                  */
#define _SMCTRL_TXDONE_TXDONE_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for SMCTRL_TXDONE              */
#define _SMCTRL_TXDONE_TXDONE_SOFTM               0x00000000UL                          /**< Mode SOFTM for SMCTRL_TXDONE                */
#define _SMCTRL_TXDONE_TXDONE_LEG                 0x00000001UL                          /**< Mode LEG for SMCTRL_TXDONE                  */
#define SMCTRL_TXDONE_TXDONE_DEFAULT              (_SMCTRL_TXDONE_TXDONE_DEFAULT << 0)  /**< Shifted mode DEFAULT for SMCTRL_TXDONE      */
#define SMCTRL_TXDONE_TXDONE_SOFTM                (_SMCTRL_TXDONE_TXDONE_SOFTM << 0)    /**< Shifted mode SOFTM for SMCTRL_TXDONE        */
#define SMCTRL_TXDONE_TXDONE_LEG                  (_SMCTRL_TXDONE_TXDONE_LEG << 0)      /**< Shifted mode LEG for SMCTRL_TXDONE          */

/** @} End of group EFR32FG25_SMCTRL_BitFields */
/** @} End of group EFR32FG25_SMCTRL */
/** @} End of group Parts */

#endif /* EFR32FG25_SMCTRL_H */
